{
    "AcceptTeeEula":  "(S/N) Accettare ora il contratto di licenza di Team Explorer Everywhere?",
    "AccessDenied":  "Accesso negato",
    "AccessDeniedSettingRecoveryOption":  "Accesso negato durante l\u0027impostazione delle opzioni di ripristino del servizio.",
    "AddAgentFailed":  "Non è stato possibile aggiungere l\u0027agente. Riprovare o premere CTRL+C per uscire",
    "AddBuildTag":  "Aggiungi tag di compilazione",
    "AddDeploymentGroupTagsFlagDescription":  "tag dei gruppi di distribuzione per l\u0027agente? (S/N)",
    "AgentAddedSuccessfully":  "L\u0027agente è stato aggiunto",
    "AgentExit":  "Tra poco l\u0027agente verrà chiuso per eseguire l\u0027aggiornamento. Dovrebbe tornare online entro 10 secondi.",
    "AgentIsNotConfigured":  "L\u0027agente non è configurato.",
    "AgentMachinePoolNameLabel":  "pool di agenti",
    "AgentName":  "nome dell\u0027agente",
    "AgentReplaced":  "L\u0027agente è stato sostituito",
    "AgentRunningBehindProxy":  "L\u0027agente in esecuzione è protetto dal server proxy: \u0027{0}\u0027",
    "AgentVersion":  "Versione corrente dell\u0027agente: \u0027{0}\u0027",
    "AgentWithSameNameAlreadyExistInPool":  "Il pool {0} contiene già un agente denominato {1}.",
    "AlreadyConfiguredError":  "Non è possibile configurare l\u0027agente perché è già configurato. Per riconfigurarlo, eseguire prima \u0027config.cmd remove\u0027 oppure \u0027./config.sh remove\u0027.",
    "ArgumentNeeded":  "È necessario specificare \u0027{0}\u0027.",
    "ArtifactCommandNotFound":  "##vso[artifact.{0}] non è un comando riconosciuto per l\u0027estensione del comando artifact. Vedere la documentazione (http://go.microsoft.com/fwlink/?LinkId=817296)",
    "ArtifactDownloadFailed":  "Non è stato possibile scaricare l\u0027artefatto da {0}.",
    "ArtifactLocationRequired":  "Il percorso dell\u0027artefatto è obbligatorio.",
    "ArtifactNameRequired":  "Il nome dell\u0027artefatto è obbligatorio.",
    "ArtifactTypeRequired":  "Il tipo dell\u0027artefatto è obbligatorio.",
    "AssociateArtifact":  "Associa artefatto",
    "AssociateArtifactCommandNotSupported":  "L\u0027associazione dell\u0027artefatto del server non è supportata in {0}.",
    "AssociateArtifactWithBuild":  "L\u0027artefatto {0} è stato associato alla compilazione {1}",
    "AttachFileNotExist":  "Non è possibile allegare il file {2} (tipo {0} nome {1}). Il file non esiste.",
    "AttachmentExceededMaximum":  "L\u0027allegato verrà ignorato perché supera la dimensione massima consentita di 75 MB: {0}",
    "AttemptRemoveCredFromConfig":  "Il tentativo di usare la riga di comando GIT per rimuovere \"http.extraheader\" dal file di configurazione GIT non è riuscito. Verrà effettuato un tentativo di modificare direttamente il file di configurazione GIT per rimuovere la credenziale.",
    "AuthenticationType":  "tipo di autenticazione",
    "AutoLogonAccountNameDescription":  "Account utente da usare per l\u0027accesso automatico",
    "AutoLogonOverwriteDeniedError":  "Non è possibile configurare l\u0027accesso automatico perché è già configurato per un altro utente ({0}) del computer. Se si vuole sovrascrivere l\u0027impostazione, usare \u0027--overwriteautologon\u0027.",
    "AutoLogonPolicies_LegalNotice":  "Note legali",
    "AutoLogonPolicies_ShutdownReason":  "Motivo dell\u0027arresto",
    "AutoLogonPoliciesInspection":  "Verifica dei criteri che possono impedire il corretto funzionamento dell\u0027accesso automatico.",
    "AutoLogonPoliciesWarningsHeader":  "I seguenti criteri possono influire sull\u0027accesso automatico:",
    "BuildCommandNotFound":  "##vso[build.{0}] non è un comando riconosciuto per l\u0027estensione del comando build. Vedere la documentazione (http://go.microsoft.com/fwlink/?LinkId=817296)",
    "BuildDirLastUseTIme":  "Data dell\u0027ultimo utilizzo della directory di compilazione \u0027{0}\u0027: {1}",
    "BuildNumberRequired":  "Il numero di build è obbligatorio.",
    "BuildTagAddFailed":  "Il tag di compilazione \u0027{0}\u0027 non è stato aggiunto.",
    "BuildTagRequired":  "Il tag di compilazione è obbligatorio.",
    "BuildTagsForBuild":  "Alla compilazione \u0027{0}\u0027 sono ora associati i tag seguenti: {1}",
    "CannotChangeParentTimelineRecord":  "Non è possibile modificare il record della sequenza temporale padre di un record della sequenza temporale esistente.",
    "CannotFindHostName":  "Non è stato trovato alcun nome dell\u0027account VSTS dall\u0027URL del server: \u0027{0}\u0027",
    "CanNotFindService":  "Il servizio {0} non è stato trovato",
    "CanNotGrantPermission":  "Non è possibile concedere l\u0027autorizzazione LogonAsService all\u0027utente {0}",
    "CanNotStartService":  "Non è possibile avviare il servizio. Per altri dettagli, vedere i log",
    "CanNotStopService":  "Non è possibile arrestare tempestivamente il servizio {0}.",
    "CannotUploadFile":  "Non è possibile caricare il file perché non ne è stato specificato il percorso.",
    "CannotUploadSummary":  "Non è possibile caricare il file di riepilogo perché non ne è stato specificato il percorso.",
    "Cleanup":  "Pulizia post processo",
    "ClockSkewStopRetry":  "I tentativi di eccezione per la richiesta del token OAuth sono stati arrestati dopo {0} secondi.",
    "CodeCoverageCommandNotFound":  "##vso[codecoverage.{0}] non è un comando riconosciuto per l\u0027estensione del comando task. Vedere la documentazione (http://go.microsoft.com/fwlink/?LinkId=817296)",
    "CodeCoverageDataIsNull":  "Non sono stati trovati dati di code coverage. Per altre informazioni, verificare gli errori o gli avvisi di compilazione.",
    "CodeCoveragePublishIsValidOnlyForBuild":  "La pubblicazione del code coverage funziona solo per \u0027build\u0027.",
    "CollectionName":  "Nome della raccolta",
    "CommandKeywordDetected":  "\u0027{0}\u0027 contiene la parola chiave del comando di registrazione \u0027##vso\u0027, ma non è un comando valido. Per correggere eventuali possibili errori di sintassi, vedere la documentazione (http://go.microsoft.com/fwlink/?LinkId=817296)",
    "CommandLineHelp":  [
                            "Comandi:",
                            " .{0}config.{1}          Configura l\u0027agente",
                            " .{0}config.{1} remove   Annulla la configurazione dell\u0027agente",
                            " .{0}run.{1}             Esegue l\u0027agente in modo interattivo. Non richiede alcuna opzione.",
                            " .{0}run.{1} localRun    Esegue un processo locale",
                            "",
                            "Opzioni:",
                            " --version  Stampa la versione dell\u0027agente",
                            " --commit   Stampa il commit dell\u0027agente",
                            " --help     Stampa la Guida relativa ai singoli comandi"
                        ],
    "CommandLineHelp_Common":  [
                                   "Opzioni comuni:",
                                   " --url \u003curl\u003e                       URL del server. Ad esempio: https://myaccount.visualstudio.com o",
                                   "                                   http://onprem:8080/tfs",
                                   " --auth \u003ctipo\u003e                     Tipo di autenticazione. I valori validi sono:",
                                   "                                    pat        (token di accesso personale)",
                                   "                                    negotiate  (Kerberos o NTLM)",
                                   "                                    alt        (autenticazione di base)",
                                   "                                    integrated (credenziali predefinite di Windows)",
                                   " --token \u003ctoken\u003e                   Usata con --auth pat. Token di accesso personale.",
                                   " --userName \u003cnomeUtente\u003e             Usata con --auth negotiate o --auth alt. Consente di specificare il nome",
                                   "                                   utente Windows in formato: dominio\\nomeUtente o nomeUtente@dominio.com",
                                   " --password \u003cpassword\u003e             Usata con --auth negotiate o --auth alt.",
                                   " --unattended                      Configurazione automatica. Non verrà visualizzata alcuna richiesta. Tutte le risposte devono essere",
                                   "                                   fornite alla riga di comando.",
                                   " --version                         Stampa la versione dell\u0027agente",
                                   " --commit   Stampa il commit dell\u0027agente",
                                   " --help                            Stampa la Guida"
                               ],
    "CommandLineHelp_Configure":  [
                                      ".{0}config.{1} [options]",
                                      "",
                                      "For unconfigure help, see: .{0}config.{1} remove --help",
                                      "",
                                      "{2}",
                                      "",
                                      "Configure options:",
                                      " --pool \u003cpool\u003e                     Pool name for the agent to join",
                                      " --agent \u003cagent\u003e                   Agent name",
                                      " --replace                         Replace the agent in a pool. If another agent is listening by that",
                                      "                                   name, it will start failing with a conflict.",
                                      " --work \u003cworkDirectory\u003e            Work directory where job data is stored. Defaults to _work under the",
                                      "                                   root of the agent directory. The work directory is owned by a given",
                                      "                                   agent and should not share between multiple agents.",
                                      " --acceptTeeEula                   macOS and Linux only. Accept the TEE end user license agreement.",
                                      "",
                                      "Startup options (Windows only):",
                                      " --runAsService                    Configure the agent to run as a Windows service. Requires",
                                      "                                   administrator permission.",
                                      " --runAsAutoLogon                  Configure auto logon and run the agent on startup. Requires",
                                      "                                   administrator permission.",
                                      " --windowsLogonAccount \u003caccount\u003e   Used with --runAsService or --runAsAutoLogon. Specify the Windows user",
                                      "                                   name in the format: domain\\userName or userName@domain.com",
                                      " --windowsLogonPassword \u003cpassword\u003e Used with --runAsService or --runAsAutoLogon. Windows logon password.",
                                      " --overwriteAutoLogon              Used with --runAsAutoLogon. Overwrite any existing auto logon on the",
                                      "                                   machine.",
                                      " --noRestart                       Used with --runAsAutoLogon. Do not restart after configuration",
                                      "                                   completes.",
                                      "",
                                      "Deployment group options:",
                                      " --deploymentGroup                 Configure the agent as a deployment group agent.",
                                      " --projectName \u003cname\u003e              Used with --deploymentGroup. Team project name.",
                                      " --addDeploymentGroupTags          Used with --deploymentGroup. Specify to add deployment group tags.",
                                      " --deploymentGroupName \u003cname\u003e      Used with --deploymentGroup. Deployment group for the agent to join.",
                                      " --deploymentGroupTags \u003ctags\u003e      Used with --addDeploymentGroupTags. A comma separated list of tags for",
                                      "                                   the deployment group agent. For example \"web, db\".",
                                      "",
                                      "{3}",
                                      "",
                                      "Unattended configuration examples:",
                                      "",
                                      "VSTS authentication",
                                      ".{0}config.{1} --unattended --url https://myaccount.visualstudio.com --auth pat --token myToken --pool default --agent myAgent --acceptTeeEula",
                                      "",
                                      "On-premises TFS with integrated authentication (Windows only)",
                                      ".\\config.cmd --unattended --url http://mylocaltfsserver:8080/tfs --auth integrated --pool default --agent myAgent",
                                      "",
                                      "On-premises TFS with negotiate authentication",
                                      ".{0}config.{1} --unattended --url http://mylocaltfsserver:8080/tfs --auth negotiate --userName myDomain\\myUserName --password myPassword --pool default --agent myAgent --acceptTeeEula",
                                      "",
                                      "Replace existing agent with the same agent name",
                                      ".{0}config.{1} --unattended --url https://myaccount.visualstudio.com --auth pat --token myToken --pool default --agent myAgent --replace --acceptTeeEula",
                                      "",
                                      "Specify the agent work directory (Windows)",
                                      ".\\config.cmd --unattended --url https://myaccount.visualstudio.com --auth pat --token myToken --pool default --agent myAgent --work D:\\agent_work",
                                      "",
                                      "Specify the agent work directory (macOS and Linux)",
                                      "./config.sh --unattended  --url https://myaccount.visualstudio.com --auth pat --token myToken --pool default --agent myAgent --work usr/local/agent_work",
                                      "",
                                      "Run as a Windows service that logs on as NetworkService (Windows only)",
                                      ".\\config.cmd --unattended --url https://myaccount.visualstudio.com --auth pat --token myToken --pool default --agent myAgent --runAsService",
                                      "",
                                      "Run as a Windows service that logs on as a domain account (Windows only)",
                                      ".\\config.cmd --unattended --url https://myaccount.visualstudio.com --auth pat --token myToken --pool default --agent myAgent --runAsService --windowsLogonAccount myDomain\\myUserName --windowsLogonPassword myPassword",
                                      "",
                                      "Run as an auto logon agent (Windows only)",
                                      ".\\config.cmd --unattended --url https://myaccount.visualstudio.com --auth pat --token myToken --pool default --agent myAgent --runAsAutoLogon --windowsLogonAccount myDomain\\myUserName --windowsLogonPassword myPassword",
                                      "",
                                      "Run as an auto logon agent and do not restart after configuration (Windows only)",
                                      ".\\config.cmd --unattended --url https://myaccount.visualstudio.com --auth pat --token myToken --pool default --agent myAgent --runAsAutoLogon --windowsLogonAccount myDomain\\myUserName --windowsLogonPassword myPassword --noRestart",
                                      "",
                                      "Deployment group agent run as Windows service that logs on as Local System (Windows only)",
                                      ".\\config.cmd --unattended --deploymentGroup --url https://myaccount.visualstudio.com --auth pat --token myToken --projectName myProject --deploymentGroupName myDeploymentGroup --agent myAgent --addDeploymentGroupTags --deploymentGroupTags \"web, db\" --runAsService --windowsLogonAccount \"NT AUTHORITY\\SYSTEM\"",
                                      "",
                                      "Deployment group agent with tags",
                                      ".{0}config.{1} --unattended --deploymentGroup --url https://myaccount.visualstudio.com --auth pat --token myToken --projectName myProject --deploymentGroupName myDeploymentGroup --agent myAgent --addDeploymentGroupTags --deploymentGroupTags \"web, db\" --runAsService --windowsLogonAccount \"NT AUTHORITY\\SYSTEM\" --acceptTeeEula"
                                  ],
    "CommandLineHelp_Env":  [
                                "Variabili di ambiente:",
                                "È possibile specificare qualsiasi argomento della riga di comando come variabile di ambiente. Usare il",
                                "formato VSTS_AGENT_INPUT_\u003cNOME_ARGOMENTO\u003e. Ad esempio: VSTS_AGENT_INPUT_PASSWORD"
                            ],
    "CommandLineHelp_LocalRun":  [
                                     ".{0}run.{1} localRun [opzioni]",
                                     "",
                                     "Questo comando è attualmente disponibile in versione di anteprima. L\u0027interfaccia e il comportamento cambieranno in una versione futura.",
                                     "",
                                     "Esegue un processo in modalità locale. Specificare --url per aggiornare la cache attività locale se sono disponibili versioni",
                                     "più recenti per eventuali attività di riferimento.",
                                     "",
                                     "Opzioni di esecuzione:",
                                     " --yml \u003cyml\u003e                       Percorso del file con estensione yml della definizione del processo.",
                                     "                                   Per impostazione predefinita, viene eseguita la ricerca nella directory corrente.",
                                     " --phase \u003cfase\u003e                   Fase da eseguire. Questa opzione è obbligatoria quando viene individuata",
                                     "                                   più di una fase dal file con estensione yml.",
                                     " --matrix \u003cmatrice\u003e                 Matrice da eseguire. Questa opzione è obbligatoria quando la fase contiene",
                                     "                                   più di una matrice di configurazione di processo.",
                                     "",
                                     "{2}",
                                     "",
                                     "{3}"
                                 ],
    "CommandLineHelp_Remove":  [
                                   ".{0}config.{1} remove [opzioni]",
                                   "",
                                   "{2}",
                                   "",
                                   "{3}",
                                   "",
                                   "Esempi di rimozione automatica:",
                                   "",
                                   "VSTS",
                                   ".{0}config.{1} remove --unattended --auth pat --token myToken",
                                   "",
                                   "TFS in locale con autenticazione integrata (solo Windows)",
                                   ".{0}config.{1} remove --unattended --auth integrated",
                                   "",
                                   "TFS in locale con autenticazione integrata",
                                   ".{0}config.{1} remove --unattended --auth negotiate --username myDomain\\myUserName --password myPassword"
                               ],
    "CommandNotFound":  "L\u0027estensione del comando per ##vso[{0}.command] non è stata trovata. Vedere la documentazione (http://go.microsoft.com/fwlink/?LinkId=817296)",
    "CommandNotSupported":  "I comandi {0} non sono supportati per il flusso {1}. Vedere la documentazione (http://go.microsoft.com/fwlink/?LinkId=817296)",
    "CommandProcessFailed":  "Non è possibile elaborare il comando \u0027{0}\u0027. Vedere la documentazione (http://go.microsoft.com/fwlink/?LinkId=817296)",
    "ConnectingToServer":  "Connessione al server...",
    "ConnectSectionHeader":  "Connetti",
    "ConnectToServer":  "Connessione al server.",
    "CouldNotRemoveService":  "Non è stato possibile eliminare il servizio \u0027{0}\u0027",
    "CreateUserWithSameUIDInsideContainer":  "Try create an user with UID \u0027{0}\u0027 inside the container.",
    "CurrentUTC":  "Ora UTC corrente: {0}",
    "CustomLogDoesNotExist":  "Il percorso file di log non è stato specificato oppure il file non esiste: \u0027{0}\u0027",
    "CustomMarkDownSummaryDoesNotExist":  "Il percorso del file di riepilogo markdown non è stato specificato oppure il file non esiste: \u0027{0}\u0027",
    "DeleteGCTrackingFile":  "Elimina il file di verifica di Garbage Collection dopo aver eliminato \u0027{0}\u0027",
    "DeleteUnusedBuildDir":  "Elimina le directory di compilazione inutilizzate",
    "Deleting":  "Eliminazione: {0}",
    "DeletingCredentials":  "Rimozione del file con estensione credentials",
    "DeletingSettings":  "Rimozione del file con estensione agent",
    "DeploymentGroupName":  "Nome del gruppo di distribuzione",
    "DeploymentGroupNotFound":  "Il gruppo di distribuzione non è stato trovato: \u0027{0}\u0027",
    "DeploymentGroupTags":  "Comma separated list of tags (e.g web, db)",
    "DeploymentGroupTagsAddedMsg":  "I tag sono stati aggiunti",
    "DeploymentMachineWithSameNameAlreadyExistInDeploymentGroup":  "Il gruppo di distribuzione {0} contiene già un computer denominato {1}.",
    "DeploymentPoolName":  "Deployment Pool name",
    "DeploymentPoolNotFound":  "Deployment pool not found: \u0027{0}\u0027",
    "DirectoryHierarchyUnauthorized":  "L\u0027autorizzazione per leggere il contenuto delle directory è obbligatoria per \u0027{0}\u0027 e per ogni directory di livello superiore nella gerarchia. {1}",
    "DirectoryIsEmptyForArtifact":  "La directory \u0027{0}\u0027 è vuota. Non verrà aggiunto nulla all\u0027artefatto di compilazione \u0027{1}\u0027.",
    "DirectoryNotFound":  "Directory non trovata: \u0027{0}\u0027",
    "DirExpireLimit":  "Limite di scadenza della directory: {0} giorni.",
    "DiscoverBuildDir":  "Rileva le directory di compilazione non aggiornate che non sono state usate per più di {0} giorni.",
    "DownloadAgent":  "Download dell\u0027agente {0}",
    "DownloadArtifacts":  "Scarica artefatti",
    "DownloadArtifactsFailed":  "Il download degli artefatti non è riuscito: {0}",
    "DownloadingJenkinsCommitsBetween":  "Download dei commit tra il processo {0} e {1}",
    "DownloadingJenkinsCommitsFailedWithException":  "Il download dei commit per l\u0027artefatto Jenkins {0} non è riuscito. Eccezione: {1}",
    "DownloadingTask0":  "Download dell\u0027attività: {0}",
    "EnsureJobFinished":  "In attesa del completamento dell\u0027esecuzione del processo corrente.",
    "EnsureTasksExist":  "Scarica tutte le attività obbligatorie.",
    "EnterValidValueFor0":  "Immettere un valore valido per {0}.",
    "ErrorDuringBuildGC":  "Non è possibile rilevare gli elementi da sottoporre a Garbage Collection sulla base di \u0027{0}\u0027. Provare la prossima volta.",
    "ErrorDuringBuildGCDelete":  "Non è possibile completare la Garbage Collection sulla base di \u0027{0}\u0027. Provare la prossima volta.",
    "ErrorOccurred":  "Si è verificato un errore: {0}",
    "ErrorOccurredWhilePublishingCCFiles":  "Si è verificato un errore durante la pubblicazione dei file di code coverage. Errore: {0}",
    "EulasSectionHeader":  "Contratti di licenza con l\u0027utente finale",
    "EvaluateTrackingFile":  "Valuta il file di verifica della directory di compilazione: {0}",
    "Failed":  "Non riuscita: ",
    "FailedDeletingTempDirectory0Message1":  "Non è stato possibile eliminare la directory temporanea \u0027{0}\u0027. {1}",
    "FailedToAddTags":  "Non è stato possibile applicare tag all\u0027agente. Riprovare oppure premere CTRL+C per uscire. In alternativa, per aggiungere i tag, è possibile passare alla pagina Web del gruppo di distribuzione",
    "FailedToConnect":  "Non è stato possibile connettersi. Riprovare o premere CTRL+C per uscire",
    "FailedToDeleteTempScript":  "Non è stato possibile eliminare il file script inline temporaneo \u0027{0}\u0027. {1}",
    "FailedToFindDeploymentGroup":  "Il gruppo di distribuzione non è stato trovato. Riprovare o premere CTRL+C per uscire",
    "FailedToFindPool":  "Il nome del pool non è stato trovato. Riprovare o premere CTRL+C per uscire",
    "FailedToLockServiceDB":  "Non è stato possibile bloccare il database del servizio per la scrittura",
    "FailedToOpenSCM":  "Non è stato possibile aprire Gestione controllo servizi",
    "FailedToOpenSCManager":  "Non è stato possibile aprire Gestione controllo servizi",
    "FailedToPublishTestResults":  "Non è stato possibile pubblicare i risultati del test: {0}",
    "FailedToReadFile":  "Non è stato possibile leggere {0}. Errore: {1}.",
    "FailedToReplaceAgent":  "Non è stato possibile sostituire l\u0027agente. Riprovare o premere CTRL+C per uscire",
    "FailToRemoveGitConfig":  "Non è possibile rimuovere \"{0}\" dal file di configurazione GIT. Per rimuovere la credenziale, eseguire \"git config --unset-all {0}\" dalla radice del repository \"{1}\".",
    "FileContainerUploadFailed":  "Non è possibile copiare i file nel server. Codice di stato={0}: {1}. Percorso del file di origine: {2}. Percorso del server di destinazione: {3}",
    "FileDoesNotExist":  "Il file \u0027{0}\u0027 non esiste o non è accessibile.",
    "FileNotFound":  "File non trovato: \u0027{0}\u0027",
    "FilePathNotFound":  "Il percorso file per \u0027{0}\u0027 non è stato trovato.",
    "FileUploadCancelled":  "Il caricamento dei file è stato annullato durante il caricamento del file: \u0027{0}\u0027.",
    "FileUploadDetailTrace":  "Traccia dettagliata di caricamento per il file che non è stato caricato: {0}",
    "FileUploadFailed":  "Non è stato possibile caricare \u0027{0}\u0027 a causa di \u0027{1}\u0027.",
    "FileUploadFailedAfterRetry":  "Il caricamento del file non è riuscito anche dopo il nuovo tentativo.",
    "FileUploadFailedRetryLater":  "{0} file non sono stati caricati. Ripetere l\u0027operazione tra qualche minuto.",
    "FileUploadFinish":  "Il file \u0027{0}\u0027 ha impiegato {1} millisecondi per completare il caricamento",
    "FileUploadProgress":  "Totale file: {0} ---- File elaborato: {1} ({2}%)",
    "FileUploadProgressDetail":  "Caricamento di \u0027{0}\u0027 ({1}%)",
    "FileUploadRetry":  "Avvia il tentativo {0} per i file non caricati.",
    "FileUploadRetryInSecond":  "Riavvia il caricamento dei file dopo {0} secondi.",
    "FileUploadRetrySucceed":  "Il caricamento dei file è riuscito dopo il nuovo tentativo.",
    "FileUploadSucceed":  "Il caricamento dei file è riuscito.",
    "FinishMaintenance":  "Manutenzione completata: {0}",
    "GCBuildDir":  "Elimina le directory di compilazione orfane e non aggiornate.",
    "GCBuildDirNotEnabled":  "L\u0027opzione Elimina le directory di compilazione orfane e non aggiornate non è abilitata.",
    "GCDirIsEmpty":  "Non è necessario sottoporre a Garbage Collection alcuna directory di compilazione. Per \u0027{0}\u0027 non esiste alcun file di verifica.",
    "GCDirNotExist":  "Non è necessario sottoporre a Garbage Collection alcuna directory di compilazione. \u0027{0}\u0027 non esiste.",
    "GCOldFormatTrackingFile":  "Contrassegna il file di verifica \u0027{0}\u0027 per la Garbage Collection perché non è mai stato usato.",
    "GCUnusedTrackingFile":  "Contrassegna il file di verifica \u0027{0}\u0027 per la Garbage Collection perché non è stato usato per {1} giorni.",
    "GenerateAndRunUpdateScript":  "Genera ed esegue lo script di aggiornamento.",
    "GetSources":  "Ottieni origini",
    "GrantContainerUserSUDOPrivilege":  "Grant user \u0027{0}\u0027 SUDO privilege and allow it run any command without authentication.",
    "GrantingFilePermissions":  "Concessione delle autorizzazioni per i file a \u0027{0}\u0027.",
    "GroupDoesNotExists":  "Il gruppo {0} non esiste",
    "InitializeContainer":  "Inizializza contenitore",
    "InitializeJob":  "Inizializza processo",
    "InvalidAutoLogonCredential":  "Sono state immesse credenziali di Windows non valide per l\u0027accesso automatico. Assicurarsi che le credenziali specificate siano valide e abbiamo i diritti di accesso interattivo nel computer. Riprovare o premere CTRL-C per uscire",
    "InvalidCommandArg":  "L\u0027argomento \u0027{0}\u0027 del comando contiene uno o più dei caratteri non validi seguenti: \", \\r, \\n",
    "InvalidCommandResult":  "Il valore del risultato del comando non è valido.",
    "InvalidCompletedDate":  "Per il calcolo del tempo verrà usata la durata di ogni esecuzione dei test perché il valore della data di completamento massima {0} ottenuta dal file dei risultati del test è maggiore di quello della data di inizio minima {1}",
    "InvalidConfigFor0TerminatingUnattended":  "La configurazione specificata per {0} non è valida. La configurazione automatica verrà terminata.",
    "InvalidDateFormat":  "Per il calcolo del tempo verrà usata la durata di ogni esecuzione dei test perché il formato della data ottenuto dal file di risultati {0} non è valido. Data di inizio: {1}. Data di completamento: {2}",
    "InvalidEndpointField":  "Invalid endpoint field. Valid values are url, dataParameter and authParameter",
    "InvalidEndpointId":  "Invalid endpoint id.",
    "InvalidEndpointUrl":  "Invalid endpoint Url.",
    "InvalidFileFormat":  "Il formato di file non è valido.",
    "InvalidGroupName":  "Nome di gruppo non valido - {0}",
    "InvalidMember":  "Non è stato possibile aggiungere un nuovo membro perché il tipo di account del membro è errato. Se si intende eseguire la configurazione in un controller di dominio, non è possibile aggiungere account computer predefiniti a gruppi locali, ma è necessario usare un account utente di dominio",
    "InvalidResultFiles":  "Il file di risultati non è valido. Assicurarsi che il formato dei risultati del file \u0027{0}\u0027 corrisponda a quello dei risultati del test \u0027{1}\u0027.",
    "InvalidSIDForUser":  "L\u0027ID di sicurezza non è valido per l\u0027utente {0}\\{1} per la configurazione/annullamento della configurazione dell\u0027accesso automatico. Per altri dettagli, vedere i log.",
    "InvalidValueInXml":  "Non è possibile recuperare il valore per \u0027{0}\u0027 dal file di riepilogo \u0027{1}\u0027. Verificare che il file di riepilogo sia ben formato e riprovare.",
    "InvalidWindowsCredential":  "Le credenziali di Windows immesse non sono valide. Riprovare o premere CTRL+C per uscire",
    "JenkinsBuildDoesNotExistsForCommits":  "Non è possibile trovare l\u0027indice di compilazione per le compilazioni Jenkins {0} e {1}. Gli indici trovati sono {2} e {3}. Probabilmente la compilazione non esiste",
    "JenkinsCommitsInvalidEndJobId":  "L\u0027oggetto endJobId {0} associato all\u0027artefatto Jenkins {1} non è valido. Non verrà eseguito il download dei commit.",
    "JenkinsDownloadingChangeFromCurrentBuild":  "Non è possibile trovare endJobId. Verrà recuperato l\u0027insieme di modifiche della compilazione corrente",
    "JenkinsNoCommitsToFetch":  "Distribuzione della stessa compilazione. Nessun commit da recuperare",
    "JenkinsRollbackDeployment":  "Download dei commit per la distribuzione di rollback tra il processo {0} e {1}",
    "JobCompleted":  "{0:u}: il processo {1} è stato completato con il risultato {2}",
    "ListenForJobs":  "{0:u}: in ascolto dei processi",
    "LocalClockSkewed":  "L\u0027orologio del computer locale potrebbe non essere sincronizzato con l\u0027ora del server e la differenza potrebbe essere superiore a cinque minuti. Sincronizzare l\u0027orologio con l\u0027ora di dominio o Internet, quindi riprovare.",
    "LocalSystemAccountNotFound":  "L\u0027account di sistema locale non è stato trovato",
    "Maintenance":  "Manutenzione",
    "MemberDoesNotExists":  "Il membro {0} non esiste",
    "MinimumNetFramework":  "È richiesto .NET Framework x64 4.5 o versione successiva.",
    "MinimumNetFramework46":  "È richiesto .NET Framework x64 4.6 o versione successiva.",
    "MinimumNetFrameworkTfvc":  [
                                    ".NET Framework x64 4.6 o versione successiva non è installato.",
                                    "",
                                    ".NET Framework x64 4.6 o versione successiva è obbligatorio per la sincronizzazione dei repository del controllo della versione di Team Foundation, ma non per quella dei repository GIT."
                                ],
    "MinRequiredDockerClientVersion":  "La versione minima richiesta del client di Docker è \u0027{0}\u0027, mentre la versione corrente del client di Docker (\u0027{1}\u0027) è \u0027{2}\u0027",
    "MinRequiredDockerServerVersion":  "La versione minima richiesta del server di Docker è \u0027{0}\u0027, mentre la versione corrente del server di Docker (\u0027{1}\u0027) è \u0027{2}\u0027",
    "MinRequiredGitLfsVersion":  "La versione minima richiesta di git-lfs è \u0027{0}\u0027, mentre la versione di git-lfs (\u0027{1}\u0027) corrente è \u0027{2}\u0027",
    "MinRequiredGitVersion":  "La versione minima richiesta di GIT è \u0027{0}\u0027, mentre la versione di GIT (\u0027{1}\u0027) corrente è \u0027{2}\u0027",
    "MissingAgent":  "L\u0027agente non esiste più nel server. Riconfigurarlo.",
    "MissingAttachmentFile":  "Non è possibile caricare il file allegato dell\u0027attività perché non ne è stato specificato il percorso o il file allegato non esiste nel disco",
    "MissingAttachmentName":  "Non è possibile aggiungere l\u0027allegato dell\u0027attività perché non ne è stato specificato il nome.",
    "MissingAttachmentType":  "Non è possibile aggiungere l\u0027allegato dell\u0027attività perché non ne è stato specificato il tipo.",
    "MissingConfig":  "Non è possibile connettersi al server perché mancano i file di configurazione. La rimozione dell\u0027agente dal server verrà ignorata.",
    "MissingEndpointField":  "Required field \u0027field\u0027 is missing in ##vso[task.setendpoint] command.",
    "MissingEndpointId":  "Required field \u0027id\u0027 is missing in ##vso[task.setendpoint] command.",
    "MissingEndpointKey":  "Required field \u0027key\u0027 is missing in ##vso[task.setendpoint] command.",
    "MissingTaskVariableName":  "Nel comando ##vso[task.settaskvariable] manca il campo obbligatorio \u0027variable\u0027.",
    "MissingTimelineRecordId":  "Non è possibile aggiornare il record della sequenza temporale perché non ne è stato specificato l\u0027ID.",
    "MissingVariableName":  "Nel comando ##vso[task.setvariable] manca il campo obbligatorio \u0027variable\u0027.",
    "ModifyingCoberturaIndexFile":  "Modifica del file di indice di Cobertura",
    "N":  "N",
    "NameRequiredForTimelineRecord":  "Per questo nuovo record della sequenza temporale è richiesto un nome.",
    "NeedAdminForAutologonCapability":  "Per configurare l\u0027agente con l\u0027accesso automatico, sono necessari i privilegi di amministratore.",
    "NeedAdminForAutologonRemoval":  "Per annullare la configurazione di un agente in esecuzione con la funzionalità di accesso automatico, sono necessari i privilegi di amministratore.",
    "NeedAdminForConfigAgentWinService":  "Per configurare l\u0027agente come servizio di Windows, sono necessari i privilegi di amministratore.",
    "NeedAdminForUnconfigWinServiceAgent":  "Per annullare la configurazione dell\u0027agente eseguito come servizio di Windows, sono necessari i privilegi di amministratore.",
    "NetworkServiceNotFound":  "L\u0027account del servizio di rete non è stato trovato",
    "NoArtifactsFound":  "Non sono disponibili artefatti nella versione \u0027{0}\u0027.",
    "NoRestart":  "Restart the machine at a later time? (Y/N) (press enter for N)",
    "NoRestartSuggestion":  "AutoLogon was enabled during agent configuration. It is recommended that the machine be restarted for AutoLogon settings to take effect.",
    "NotLinux":  "Questa versione dell\u0027agente è compilata per Linux. Installare una build corretta per il sistema operativo usato.",
    "NotOSX":  "Questa versione dell\u0027agente è compilata per OS X. Installare una build corretta per il sistema operativo usato.",
    "NotWindows":  "Questa versione dell\u0027agente è compilata per Windows. Installare una build corretta per il sistema operativo usato.",
    "OperatingSystemShutdown":  "Arresto del sistema operativo per il computer \u0027{0}\u0027",
    "OperationFailed":  "Errore: l\u0027operazione {0} non è riuscita. Codice restituito: {1}",
    "OutputVariablePublishFailed":  "Non è stato possibile pubblicare le variabili di output.",
    "OverwriteAutoLogon":  "Poiché l\u0027accesso automatico è già abilitato per l\u0027utente \u0027{0}\u0027, sovrascriverne le impostazioni esistenti? (S/N)",
    "ParentTimelineNotCreated":  "Non è stato creato il record della sequenza temporale padre per questo nuovo record della sequenza temporale.",
    "Password":  "password",
    "PathNotExist":  "Il percorso {0} non esiste",
    "PersonalAccessToken":  "token di accesso personale",
    "PlatformNotSupport":  "L\u0027esecuzione dell\u0027agente in questa piattaforma non è supportata. La piattaforma corrente è {0} ed è stata compilata per {1}.",
    "PoolNotFound":  "Il pool di agenti non è stato trovato: \u0027{0}\u0027",
    "PostJob":  "Dopo il processo: {0}",
    "PowerOptionsConfigError":  "Si è verificato un errore durante la configurazione delle opzioni risparmio energia. Per altri dettagli, vedere i log.",
    "PowerShellNotInstalledMinVersion0":  "PowerShell non è installato. Versione minima richiesta: {0}",
    "PreJob":  "Prima del processo: {0}",
    "PrepareBuildDir":  "Prepara la directory di compilazione.",
    "PrepareReleasesDir":  "Prepara la directory della versione.",
    "PrepareTaskExecutionHandler":  "Preparazione del gestore per l\u0027esecuzione delle attività.",
    "Prepending0WithDirectoryContaining1":  "Alla variabile di ambiente {0} verrà anteposta la directory che contiene \u0027{1}\u0027.",
    "PrerequisitesSectionHeader":  "Prerequisiti",
    "ProcessCompletedWithCode0Errors1":  "Il processo è stato completato. È stato restituito il codice di uscita {0} e sono stati scritti {1} errori nel flusso di errori.",
    "ProcessCompletedWithExitCode0":  "Il processo è stato completato con il codice di uscita {0}.",
    "ProcessExitCode":  "Il processo con nome file \u0027{1}\u0027 e argomenti \u0027{2}\u0027 ha restituito il codice di uscita {0}.",
    "ProfileLoadFailure":  "Non è possibile caricare il profilo per l\u0027utente {0}\\La configurazione di accesso automatico {1} non è possibile.",
    "ProjectName":  "Nome del progetto",
    "Prompt0":  "Immettere {0}",
    "Prompt0Default1":  "Immettere {0} (premere INVIO per {1})",
    "PSScriptError":  "Lo script PowerShell è stato completato con {0} errori.",
    "PublishCodeCoverage":  "Pubblica code coverage",
    "PublishedCodeCoverageArtifact":  "\u0027{0}\u0027 è stato pubblicato come artefatto \u0027{1}\u0027",
    "PublishingCodeCoverage":  "Pubblicazione dei dati di riepilogo del code coverage nel server TFS.",
    "PublishingCodeCoverageFiles":  "Pubblicazione dei file di code coverage nel server TFS.",
    "PublishingTestResults":  "Pubblicazione dei risultati del test per l\u0027esecuzione dei test \u0027{0}\u0027",
    "PublishTestResults":  "Pubblica risultati del test",
    "QueryingWorkspaceInfo":  "Richiesta delle informazioni sull\u0027area di lavoro.",
    "QueueConError":  "{0:u}: Agent connect error: {1}. Retrying until reconnected.",
    "QueueConnected":  "{0:u}: l\u0027agente è stato riconnesso.",
    "ReadingCodeCoverageSummary":  "Lettura del riepilogo di code coverage da \u0027{0}\u0027",
    "RegisterAgentSectionHeader":  "Registra agente",
    "RenameIndexFileCoberturaFailed":  "La ridenominazione di \u0027{0}\u0027 in \u0027{1}\u0027 non è riuscita durante la pubblicazione dei file di code coverage per \u0027{2}\u0027. Eccezione interna: \u0027{3}\u0027",
    "Replace":  "sostituire? (S/N)",
    "RestartIn15SecMessage":  "Riavvio del computer tra 15 secondi...",
    "RestartMessage":  "Riavviare il computer per avviare l\u0027agente e per rendere effettive le impostazioni di accesso automatico.",
    "ResultsCommandNotFound":  "##vso[results.{0}] non è un comando riconosciuto per l\u0027estensione del comando task. TODO: DOC aka link",
    "RMApiFailure":  "L\u0027API {0} non è riuscita con codice errore {1}",
    "RMArtifactContainerDetailsInvalidError":  "L\u0027artefatto non contiene dettagli validi sui contenitori: {0}",
    "RMArtifactContainerDetailsNotFoundError":  "L\u0027artefatto non contiene dettagli sui contenitori: {0}",
    "RMArtifactDetailsIncomplete":  "Le informazioni necessarie per scaricare l\u0027artefatto non sono state trovate",
    "RMArtifactDirectoryNotFoundError":  "La directory degli artefatti non esiste: {0}. Questo problema può verificarsi se la password dell\u0027account {1} è stata modificata di recente e non è stata aggiornata per l\u0027agente. In tal caso, provare a riconfigurare l\u0027agente.",
    "RMArtifactDownloadBegin":  "Download dell\u0027artefatto collegato {0} di tipo {1}...",
    "RMArtifactDownloadFinished":  "L\u0027artefatto collegato {0} è stato scaricato",
    "RMArtifactDownloadRequestCreationFailed":  "Non è stato possibile creare la richiesta di download dell\u0027artefatto dall\u0027URL: {0}",
    "RMArtifactEmpty":  "L\u0027artefatto non contiene file da scaricare.",
    "RMArtifactMatchNotFound":  "L\u0027artefatto di compilazione \u0027{0}\u0027 non corrisponde ad alcun criterio di denominazione. Il download verrà ignorato",
    "RMArtifactNameDirectoryNotFound":  "La directory \u0027{0}\u0027 non esiste. Verrà eseguito il fallback alla directory padre: {1}",
    "RMArtifactsDownloadFinished":  "Il download degli artefatti è terminato",
    "RMArtifactTypeFileShare":  "Tipo di artefatto: FileShare",
    "RMArtifactTypeNotSupported":  "Release Management non supporta il download del tipo di artefatto {0} nella versione corrente",
    "RMArtifactTypeServerDrop":  "Tipo di artefatto: ServerDrop",
    "RMArtifactVersionNotBelongToArtifactSource":  "La versione dell\u0027artefatto con ID {0} non appartiene all\u0027origine artefatto collegata con ID {1}.",
    "RMBuildNotFromLinkedDefinition":  "La compilazione {0} non appartiene alla definizione di compilazione collegata {1}",
    "RMCachingAllItems":  "Memorizzazione nella cache di tutti gli elementi presenti nel contenitore di file...",
    "RMCachingComplete":  "Memorizzazione nella cache completata. ({0} ms)",
    "RMCachingContainerItems":  "Memorizzazione nella cache degli elementi in \u0027{0}\u0027 presenti nel contenitore di file...",
    "RMContainerItemNotSupported":  "Il tipo \u0027{0}\u0027 dell\u0027elemento contenitore non è supportato.",
    "RMContainerItemPathDoesnotExist":  "Il percorso dell\u0027elemento contenitore di file non inizia con {0}: {1}",
    "RMContainerItemRequestTimedOut":  "Si è verificato il timeout della richiesta dopo {0} secondi. Verrà effettuato un nuovo tentativo dopo una sospensione di {1} secondi. Richiesta: {2} {3}",
    "RMCreatedArtifactsDirectory":  "La directory degli artefatti {0} è stata creata",
    "RMCreatingArtifactsDirectory":  "Creazione della directory degli artefatti: {0}",
    "RMCustomEndpointNotFound":  "Nel processo non sono state trovate le informazioni necessarie per scaricare l\u0027artefatto personalizzato: {0}",
    "RMDownloadArtifactUnexpectedError":  "Si è verificato un errore imprevisto durante il download degli artefatti",
    "RMDownloadBufferSize":  "Dimensione del buffer di download: {0}",
    "RMDownloadComplete":  "Download completato.",
    "RMDownloadingArtifact":  "Download dell\u0027artefatto",
    "RMDownloadingArtifactFromFileContainer":  "Download dell\u0027artefatto dal contenitore file: {0} nella destinazione: {1}",
    "RMDownloadingArtifactFromFileShare":  "Download dell\u0027artefatto dalla condivisione file: {0} nella destinazione: {1}",
    "RMDownloadingArtifactUsingRobocopy":  "Download dell\u0027artefatto con robocopy.",
    "RMDownloadingCommits":  "Download dei commit",
    "RMDownloadingJenkinsArtifacts":  "Download degli artefatti dal server Jenkins",
    "RMDownloadProgress":  "{0} file inseriti: {1} scaricato/i, {2} vuoto/i",
    "RMDownloadProgressDetails":  "{0} MB scaricati a {1} KB/sec. Tempo di download: {2}.",
    "RMDownloadStartDownloadOfFile":  "Download del file {0}",
    "RMDownloadTaskCompletedStatus":  "Non è stata completata alcuna attività di download in {0} minuti. Stati delle attività rimanenti:",
    "RMDownloadTaskStates":  " {0}: \t{1} attività.",
    "RMEnsureArtifactFolderExistsAndIsClean":  "Verifica dell\u0027esistenza e della pulizia della cartella degli artefatti {0}.",
    "RMEnvironmentVariablesAvailable":  "Le variabili di ambiente disponibili sono elencate di seguito. È possibile farvi riferimento nell\u0027attività sostituendo \"_\" con \".\" nella definizione di versione. Ad esempio, è possibile fare riferimento alla variabile di ambiente AGENT_NAME usando Agent.Name nella definizione di versione: {0}",
    "RMErrorDownloadingContainerItem":  "Si è verificato un errore durante il download di {0}: {1}",
    "RMErrorDuringArtifactDownload":  "Si è verificato un errore durante il download: {0}",
    "RMFailedCreatingArtifactDirectory":  "Non è stato possibile creare la directory degli artefatti della versione \u0027{0}\u0027.",
    "RMFileShareArtifactErrorOnNonWindowsAgent":  "Non è possibile scaricare artefatti da una condivisione file con un agente OSX o Linux. È possibile scaricare l\u0027artefatto dal server o usare un agente Windows.",
    "RMGitEndpointNotFound":  "Nel processo non sono state trovate le informazioni necessarie per scaricare l\u0027artefatto GIT di Team Foundation.",
    "RMGitHubEndpointNotFound":  "Nel processo non sono state trovate le informazioni necessarie per scaricare l\u0027artefatto di GitHub: {0}",
    "RMGotJenkinsArtifactDetails":  "I dettagli degli artefatti Jenkins sono stati ricevuti",
    "RMJenkinsBuildId":  "ID compilazione: {0}",
    "RMJenkinsEndpointNotFound":  "Nel processo non sono state trovate le informazioni necessarie per scaricare l\u0027artefatto di Jenkins: {0}",
    "RMJenkinsInvalidBuild":  "La compilazione Jenkins {0} non è valida.",
    "RMJenkinsJobName":  "Nome processo: {0}",
    "RMJenkinsNoArtifactsFound":  "Non sono disponibili artefatti nella compilazione Jenkins {0}.",
    "RMLowAvailableDiskSpace":  "Low disk space on {0} drive, less than 100 MB is available.",
    "RMNoBuildArtifactsFound":  "Non sono disponibili artefatti nella compilazione {0}.",
    "RMParallelDownloadLimit":  "Limite per download in parallelo: {0}",
    "RMPrepareToGetFromJenkinsServer":  "Sono in corso le operazioni di preparazione per ottenere le informazioni sugli artefatti dal server Jenkins",
    "RMPreparingToDownload":  "Preparazione del download dell\u0027artefatto: {0}",
    "RMPreparingToGetBuildArtifactList":  "Sono in corso le operazioni di preparazione per ottenere l\u0027elenco degli artefatti disponibili dalla compilazione",
    "RMReAttemptingDownloadOfContainerItem":  "Verrà effettuato un nuovo tentativo di download di {0}. Errore: {1}",
    "RMReceivedGithubArtifactDetails":  "I dettagli degli artefatti GitHub sono stati ricevuti",
    "RMRemainingDownloads":  "{0} download rimanenti.",
    "RMRetryingArtifactDownload":  "Nuovo tentativo di download...",
    "RMRetryingCreatingArtifactsDirectory":  "Non è stato possibile creare la directory degli artefatti della versione \u0027{0}\u0027 ed è stata restituita un\u0027eccezione {1}. Verrà effettuato un nuovo tentativo di creazione.",
    "RMRobocopyBasedArtifactDownloadExitCode":  "Codice di uscita di robocopy: {0}",
    "RMRobocopyBasedArtifactDownloadFailed":  "Download basato su robocopy non riuscito con codice di uscita: {0}",
    "RMStartArtifactsDownload":  "Avvio del download degli artefatti...",
    "RMStreamTypeNotSupported":  "Release Management non supporta il download del tipo di flusso {0} nella versione corrente",
    "RMTfsVCEndpointNotFound":  "Nel processo non sono state trovate le informazioni necessarie per scaricare l\u0027artefatto di controllo della versione di Team Foundation.",
    "RMUserChoseToSkipArtifactDownload":  "Il download degli artefatti verrà ignorato in base all\u0027impostazione specificata.",
    "RSAKeyFileNotFound":  "Il file di chiave RSA {0} non è stato trovato",
    "RunAgentAsServiceDescription":  "eseguire l\u0027agente come servizio? (S/N)",
    "RunAsAutoLogonDescription":  "configurare l\u0027accesso automatico ed eseguire l\u0027agente all\u0027avvio? (S/N)",
    "RunningJob":  "{0:u}: esecuzione del processo {1}",
    "SavedSettings":  "{0:u}: le impostazioni sono state salvate.",
    "ScanToolCapabilities":  "Analisi delle funzionalità degli strumenti.",
    "ScreenSaverPoliciesInspection":  "Verifica dei criteri che possono impedire la disabilitazione dello screen saver.",
    "ScreenSaverPolicyWarning":  "Screensaver policy is defined on the machine. This may lead to screensaver being enabled again. Active screensaver may impact UI operations, for e.g., automated UI tests may fail.",
    "SelfManageGitCreds":  "È attiva la modalità di gestione automatica delle credenziali GIT. Assicurarsi che il computer host dell\u0027agente sia in grado di ignorare eventuali richieste di autenticazione GIT.",
    "ServerTarpit":  "Il processo è attualmente limitato dal server. È possibile riscontrare ritardi nell\u0027output della riga di comando, nella creazione di report sullo stato dei processi e nei caricamenti dei log delle attività.",
    "ServerUrl":  "URL server",
    "ServiceAlreadyExists":  "Il servizio {0} esiste già e verrà sostituito",
    "ServiceConfigured":  "Il servizio {0} è configurato",
    "ServiceInstalled":  "Il servizio {0} è stato installato",
    "ServiceRecoveryOptionSet":  "Il servizio {0} ha impostato l\u0027opzione di ripristino",
    "ServiceStartedSuccessfully":  "Il servizio {0} è stato avviato",
    "SessionCreateFailed":  "Non è stato possibile creare la sessione. {0}",
    "SessionExist":  "Esiste già una sessione per questo agente.",
    "SessionExistStopRetry":  "I tentativi su SessionConflictException verranno interrotti dopo {0} secondi.",
    "SetBuildVars":  "Imposta le variabili di compilazione.",
    "SetEnvVar":  "Impostazione della variabile di ambiente {0}",
    "ShallowCheckoutFail":  "Il comando git checkout non è riuscito su un repository superficiale. Questo problema potrebbe essersi verificato perché git fetch con profondità \u0027{0}\u0027 non include il commit di checkout \u0027{1}\u0027. Vedere la documentazione (http://go.microsoft.com/fwlink/?LinkId=829603)",
    "ShutdownMessage":  "Riavvio del computer per avviare l\u0027agente in modalità interattiva.",
    "Skipping":  "Non esiste. Verrà ignorato ",
    "SkipTrackingFileWithoutRepoType":  "Skip tracking file \u0027{0}\u0027, repository type haven\u0027t been updated yet.",
    "SourceArtifactProviderNotFound":  "Non è stato trovato alcun provider di origine per l\u0027artefatto di tipo {0}",
    "StartingArtifactDownload":  "Avvio del download di {0}",
    "StartMaintenance":  "Avvia la manutenzione: {0}",
    "StepFinishing":  "Fine di {0}",
    "StepStarting":  "Avvio di {0}",
    "StepTimedOut":  "Timeout dell\u0027attività.",
    "StopContainer":  "Arresta contenitore",
    "Success":  "Riuscita: ",
    "SupportedRepositoryEndpointNotFound":  "Non è possibile associare nessuno degli endpoint dei repository di origine con uno dei provider di origine supportati.",
    "SupportedTaskHandlerNotFound":  "Non è stato trovato alcun gestore di esecuzione attività supportato. Questo errore indica in genere che all\u0027attività non è associata un\u0027implementazione compatibile con il sistema operativo corrente. Per altri dettagli, contattare l\u0027autore dell\u0027attività.",
    "SvnBranchCheckedOut":  "Il ramo {0} per il repository {1} alla revisione {2} è stato estratto",
    "SvnEmptyServerPath":  "È stato eseguito il mapping del percorso server relativo vuoto a \u0027{0}\u0027.",
    "SvnFileAlreadyExists":  "Il file {0} esiste già",
    "SvnIncorrectRelativePath":  "Il percorso relativo specificato \u0027{0}\u0027 non è corretto.",
    "SvnMappingDuplicateLocal":  "Il mapping duplicato per il percorso locale {0} verrà ignorato",
    "SvnMappingDuplicateServer":  "Il mapping duplicato per il percorso server {0} verrà ignorato",
    "SvnMappingIgnored":  "L\u0027intero set di mapping viene ignorato. Si procederà con il mapping completo dei rami.",
    "SvnNotInstalled":  "Non è stata trovata l\u0027utilità da riga di comando svn installata",
    "SvnSyncingRepo":  "Sincronizzazione del repository: {0} (SVN)",
    "TaskCommandNotFound":  "##vso[task.{0}] non è un comando riconosciuto per l\u0027estensione del comando task. Vedere la documentazione (http://go.microsoft.com/fwlink/?LinkId=817296)",
    "TeeEula":  [
                    "Per la compilazione di origini da un repository del controllo della versione di Team Foundation è necessario accettare il contratto di licenza con l\u0027utente finale di Team Explorer Everywhere. Questo passaggio non è obbligatorio per la compilazione di origini da repository GIT.",
                    "",
                    "Per una copia del contratto di licenza con l\u0027utente finale di Team Explorer Everywhere, vedere:",
                    "  {0}"
                ],
    "Telemetry":  "Telemetria",
    "TelemetryCommandDataError":  "Non è possibile analizzare i dati di telemetria {0}. Errore: {1}",
    "TelemetryCommandFailed":  "Failed to publish telemetry data. Error {0}",
    "TelemetryCommandNotFound":  "##vso[telemetry.{0}] non è un comando riconosciuto per l\u0027estensione del comando task.",
    "TestAgentConnection":  "Test della connessione agente.",
    "TestAttachmentNotExists":  "L\u0027allegato verrà ignorato perché non è disponibile sul disco: {0}",
    "TestResultsRemaining":  "Risultati del test rimanenti: {0}. ID esecuzione dei test: {1}",
    "Tfs2015NotSupported":  "Questo agente non è supportato in Windows con TFS 2015. È possibile scaricare l\u0027agente Windows per TFS 2015 dalla pagina di amministrazione dei pool di agenti.",
    "TotalThrottlingDelay":  "Per il processo sono stati riscontrati in totale {0} secondi di ritardo causato dalla limitazione del server.",
    "TotalUploadFiles":  "Caricamento di {0} file",
    "TypeRequiredForTimelineRecord":  "Per questo nuovo record della sequenza temporale è richiesto un tipo.",
    "UnableResolveArtifactType":  "Non è possibile dedurre il tipo di artefatto dalla posizione dell\u0027artefatto: {0}.",
    "UnableToArchiveResults":  "Non è possibile archiviare i risultati del test: {0}",
    "UnableToParseBuildTrackingConfig0":  "Non è possibile analizzare la configurazione di verifica delle compilazioni legacy. Verrà creata una nuova directory di compilazione. La directory precedente potrebbe rimanere in uno stato non recuperato. Contenuto della configurazione legacy: {0}",
    "UnconfigAutologon":  "Rimozione delle impostazioni di accesso automatico",
    "UnconfigureOSXService":  "Annullare prima la configurazione del servizio in base alle istruzioni fornite nella pagina all\u0027indirizzo https://www.visualstudio.com/it-it/docs/build/admin/agents/v2-osx",
    "UnconfigureServiceDService":  "Annullare prima la configurazione del servizio in base alle istruzioni fornite nella pagina all\u0027indirizzo https://www.visualstudio.com/it-it/docs/build/admin/agents/v2-linux",
    "UninstallingService":  "Rimozione del servizio",
    "UnknownCodeCoverageTool":  "Lo strumento di code coverage \u0027{0}\u0027 non è supportato.",
    "UnrecognizedCmdArgs":  "Gli argomenti di input della riga di comando non sono stati riconosciuti: \u0027{0}\u0027. Per l\u0027utilizzo fare riferimento a .\\config.cmd --help o a ./config.sh --help",
    "UnregisteringAgent":  "Rimozione dell\u0027agente dal server",
    "UpdateBuildNumber":  "Aggiorna il numero di build",
    "UpdateBuildNumberForBuild":  "Aggiorna il numero di build a {0} per la build {1}",
    "UpdateInProgress":  "È in corso l\u0027aggiornamento dell\u0027agente. Non arrestare l\u0027agente.",
    "UpgradeToLatestGit":  "Per ottimizzare l\u0027esperienza GIT, aggiornare GIT almeno alla versione \u0027{0}\u0027. La versione corrente di GIT è \u0027{1}\u0027.",
    "UploadArtifact":  "Carica artefatto",
    "UploadArtifactCommandNotSupported":  "Il caricamento dell\u0027artefatto del server non è supportato in {0}.",
    "UploadToFileContainer":  "Carica \u0027{0}\u0027 nel contenitore di file \u0027{1}\u0027",
    "UserName":  "nome utente",
    "UserShutdownAgent":  "L\u0027agente ha ricevuto un segnale di arresto. Questo problema può verificarsi quando il servizio dell\u0027agente viene arrestato o quando viene annullato un agente avviato manualmente.",
    "Variable0ContainsCyclicalReference":  "Non è possibile espandere la variabile \u0027{0}\u0027. È stato rilevato un riferimento ciclico.",
    "Variable0ExceedsMaxDepth1":  "Non è possibile espandere la variabile \u0027{0}\u0027. È stata superata la profondità di espansione massima ({1}).",
    "VSTSHostNonZeroReturn":  "LegacyVSTSPowerShellHost.exe è stato completato. Codice restituito: {0}.",
    "WaitForServiceToStop":  "In attesa dell\u0027arresto del servizio...",
    "WindowsLogonAccountNameDescription":  "Account utente da usare per il servizio",
    "WindowsLogonPasswordDescription":  "Password per l\u0027account {0}",
    "WorkFolderDescription":  "cartella di lavoro",
    "Y":  "S"
}
