{
    "AcceptTeeEula":  "(S/N) ¿Acepta ahora el contrato de licencia de Team Explorer Everywhere?",
    "AccessDenied":  "Acceso denegado",
    "AccessDeniedSettingRecoveryOption":  "Acceso denegado al establecer las opciones de recuperación del servicio.",
    "AddAgentFailed":  "No se pudo agregar el agente.  Vuelva a intentarlo o presione Ctrl-C para salir.",
    "AddBuildTag":  "Agregar etiqueta de compilación",
    "AddDeploymentGroupTagsFlagDescription":  "etiquetas del grupo de implementación para el agente? (S/N)",
    "AgentAddedSuccessfully":  "El agente se agregó correctamente.",
    "AgentExit":  "El agente se cerrará en breve para someterse a una actualización; debería volver a estar en línea en menos de 10 segundos.",
    "AgentIsNotConfigured":  "El agente no se ha configurado.",
    "AgentMachinePoolNameLabel":  "grupo de agentes",
    "AgentName":  "nombre de agente",
    "AgentReplaced":  "El agente se reemplazó correctamente.",
    "AgentRunningBehindProxy":  "El agente se está ejecutando detrás del servidor del proxy: \u0027{0}\u0027",
    "AgentVersion":  "Versión de agente actual: \u0027{0}\u0027",
    "AgentWithSameNameAlreadyExistInPool":  "El grupo {0} ya contiene un agente con el nombre {1}.",
    "AlreadyConfiguredError":  "No se puede configurar el agente porque ya está configurado. Para volver a configurar el agente, ejecute primero \u0027config.cmd remove\u0027 o \u0027./config.sh remove\u0027.",
    "ArgumentNeeded":  "\u0027{0}\u0027 debe especificarse.",
    "ArtifactCommandNotFound":  "##vso[artifact.{0}] no es un comando reconocido para la extensión de comando Artifact. Consulte la documentación de referencia (http://go.microsoft.com/fwlink/?LinkId=817296).",
    "ArtifactDownloadFailed":  "Error al descargar el artefacto desde {0}.",
    "ArtifactLocationRequired":  "La ubicación del artefacto es obligatoria.",
    "ArtifactNameRequired":  "El nombre del artefacto es obligatorio.",
    "ArtifactTypeRequired":  "El tipo de artefacto es obligatorio.",
    "AssociateArtifact":  "Asociar artefacto",
    "AssociateArtifactCommandNotSupported":  "No se admite la asociación de un artefacto del servidor en {0}.",
    "AssociateArtifactWithBuild":  "Artefacto asociado {0} con compilación {1}",
    "AttachFileNotExist":  "No se puede asociar (type:{0} name:{1}) el archivo: {2}. El archivo no existe.",
    "AttachmentExceededMaximum":  "Se omitirán los datos adjuntos porque superan el tamaño máximo permitido de 75 MB: {0}",
    "AttemptRemoveCredFromConfig":  "Se hizo un intento sin éxito mediante la línea de comandos de Git para quitar \"http.extraheader\" de la configuración de Git. Se va a intentar modificar el archivo de configuración de Git directamente para quitar la credencial.",
    "AuthenticationType":  "tipo de autenticación",
    "AutoLogonAccountNameDescription":  "Cuenta de usuario que se usará para el inicio de sesión automático",
    "AutoLogonOverwriteDeniedError":  "No se puede configurar el inicio de sesión automático porque ya se ha configurado para otro usuario ({0}) de la máquina. Use \"--overwriteautologon\" si desea sobrescribirlo.",
    "AutoLogonPolicies_LegalNotice":  "Aviso legal",
    "AutoLogonPolicies_ShutdownReason":  "Motivo del apagado",
    "AutoLogonPoliciesInspection":  "Comprobando si hay directivas que puedan impedir que el inicio de sesión automático funcione correctamente.",
    "AutoLogonPoliciesWarningsHeader":  "Las siguientes directivas pueden afectar al inicio de sesión automático:",
    "BuildCommandNotFound":  "##vso[build.{0}] no es un comando reconocido para la extensión de comando Build. Consulte la documentación de referencia (http://go.microsoft.com/fwlink/?LinkId=817296).",
    "BuildDirLastUseTIme":  "La última vez que el directorio de compilación \"{0}\" se usó fue: {1}",
    "BuildNumberRequired":  "El número de compilación es obligatorio.",
    "BuildTagAddFailed":  "La etiqueta de compilación \u0027{0}\u0027 no se agregó correctamente.",
    "BuildTagRequired":  "La etiqueta de compilación es obligatoria.",
    "BuildTagsForBuild":  "La compilación \u0027{0}\u0027 tiene ahora las siguientes etiquetas: {1}",
    "CannotChangeParentTimelineRecord":  "No se puede cambiar el registro de la escala de tiempo principal de un registro de escala de tiempo existente.",
    "CannotFindHostName":  "No se encuentra el nombre de cuenta de VSTS en la dirección URL de servidor: \u0027{0}\u0027",
    "CanNotFindService":  "No se puede encontrar el servicio {0}.",
    "CanNotGrantPermission":  "No se puede conceder permiso de LogonAsService al usuario {0}.",
    "CanNotStartService":  "No se puede iniciar el servicio. Compruebe los registros para más información.",
    "CanNotStopService":  "No se puede detener el servicio {0} de manera oportuna.",
    "CannotUploadFile":  "No se puede cargar el archivo porque no se ha especificado la ubicación.",
    "CannotUploadSummary":  "No se puede cargar el archivo de resumen. No se ha especificado la ubicación del archivo de resumen.",
    "Cleanup":  "Registrar limpieza de trabajos",
    "ClockSkewStopRetry":  "Se detuvo el reintento de la excepción de solicitud del token de OAuth después de {0} segundos.",
    "CodeCoverageCommandNotFound":  "##vso[codecoverage.{0}] no es un comando reconocido para la extensión de comando Task. Consulte la documentación de referencia (http://go.microsoft.com/fwlink/?LinkId=817296).",
    "CodeCoverageDataIsNull":  "No se encontraron datos de cobertura. Compruebe los errores o advertencias de compilación para más información.",
    "CodeCoveragePublishIsValidOnlyForBuild":  "La cobertura de código de publicación solo funciona para \u0027compilación\u0027.",
    "CollectionName":  "Nombre de la colección",
    "CommandKeywordDetected":  "\"{0}\" contiene la palabra clave del comando de registro \"##vso\", pero no es un comando correcto. Consulte la documentación de referencia para corregir cualquier posible error de sintaxis (http://go.microsoft.com/fwlink/?LinkId=817296).",
    "CommandLineHelp":  [
                            "Comandos:",
                            " .{0}config.{1}                Configura el agente.",
                            " .{0}config.{1} remove   Desconfigura el agente.",
                            " .{0}run.{1}                     Ejecuta el agente de forma interactiva. No requiere opciones.",
                            " .{0}run.{1} localRun      Ejecuta un trabajo local.",
                            "",
                            "Opciones:",
                            " --version    Imprime la versión del agente.",
                            " --commit   Imprime la confirmación del agente.",
                            " --help        Imprime la ayuda de cada comando."
                        ],
    "CommandLineHelp_Common":  [
                                   "Opciones comunes:",
                                   " --url \u003curl\u003e                       URL del servidor. Por ejemplo: https://micuenta.visualstudio.com o",
                                   "                                   http://onprem:8080/tfs",
                                   " --auth \u003ctype\u003e                     Tipo de autenticación. Los valores válidos son:",
                                   "                                    pat        (token de acceso personal)",
                                   "                                    negotiate  (Kerberos o NTLM)",
                                   "                                    alt        (autenticación básica)",
                                   "                                    integrated (credenciales predeterminadas de Windows)",
                                   " --token \u003ctoken\u003e                   Se usa con --auth pat. Token de acceso personal.",
                                   " --userName \u003cuserName\u003e             Se usa con --auth negotiate o --auth alt. Especifica el nombre",
                                   "                                   del usuario de Windows  con el formato: dominio\\nombreDeUsuario",
                                   "                                   o nombreDeUsuario@dominio.com",
                                   " --password \u003cpassword\u003e             Se usa con --auth negotiate o --auth alt.",
                                   " --unattended                      Configuración desatendida. El sistema no pregunta al usuario.",
                                   "                                   Todas las respuestas deben proporcionarse en la línea de comandos.",
                                   " --version                         Imprime la versión del agente.",
                                   " --commit                          Imprime la confirmación del agente.",
                                   " --help                            Imprime la ayuda"
                               ],
    "CommandLineHelp_Configure":  [
                                      ".{0}config.{1} [options]",
                                      "",
                                      "For unconfigure help, see: .{0}config.{1} remove --help",
                                      "",
                                      "{2}",
                                      "",
                                      "Configure options:",
                                      " --pool \u003cpool\u003e                     Pool name for the agent to join",
                                      " --agent \u003cagent\u003e                   Agent name",
                                      " --replace                         Replace the agent in a pool. If another agent is listening by that",
                                      "                                   name, it will start failing with a conflict.",
                                      " --work \u003cworkDirectory\u003e            Work directory where job data is stored. Defaults to _work under the",
                                      "                                   root of the agent directory. The work directory is owned by a given",
                                      "                                   agent and should not share between multiple agents.",
                                      " --acceptTeeEula                   macOS and Linux only. Accept the TEE end user license agreement.",
                                      "",
                                      "Startup options (Windows only):",
                                      " --runAsService                    Configure the agent to run as a Windows service. Requires",
                                      "                                   administrator permission.",
                                      " --runAsAutoLogon                  Configure auto logon and run the agent on startup. Requires",
                                      "                                   administrator permission.",
                                      " --windowsLogonAccount \u003caccount\u003e   Used with --runAsService or --runAsAutoLogon. Specify the Windows user",
                                      "                                   name in the format: domain\\userName or userName@domain.com",
                                      " --windowsLogonPassword \u003cpassword\u003e Used with --runAsService or --runAsAutoLogon. Windows logon password.",
                                      " --overwriteAutoLogon              Used with --runAsAutoLogon. Overwrite any existing auto logon on the",
                                      "                                   machine.",
                                      " --noRestart                       Used with --runAsAutoLogon. Do not restart after configuration",
                                      "                                   completes.",
                                      "",
                                      "Deployment group options:",
                                      " --deploymentGroup                 Configure the agent as a deployment group agent.",
                                      " --projectName \u003cname\u003e              Used with --deploymentGroup. Team project name.",
                                      " --addDeploymentGroupTags          Used with --deploymentGroup. Specify to add deployment group tags.",
                                      " --deploymentGroupName \u003cname\u003e      Used with --deploymentGroup. Deployment group for the agent to join.",
                                      " --deploymentGroupTags \u003ctags\u003e      Used with --addDeploymentGroupTags. A comma separated list of tags for",
                                      "                                   the deployment group agent. For example \"web, db\".",
                                      "",
                                      "{3}",
                                      "",
                                      "Unattended configuration examples:",
                                      "",
                                      "VSTS authentication",
                                      ".{0}config.{1} --unattended --url https://myaccount.visualstudio.com --auth pat --token myToken --pool default --agent myAgent --acceptTeeEula",
                                      "",
                                      "On-premises TFS with integrated authentication (Windows only)",
                                      ".\\config.cmd --unattended --url http://mylocaltfsserver:8080/tfs --auth integrated --pool default --agent myAgent",
                                      "",
                                      "On-premises TFS with negotiate authentication",
                                      ".{0}config.{1} --unattended --url http://mylocaltfsserver:8080/tfs --auth negotiate --userName myDomain\\myUserName --password myPassword --pool default --agent myAgent --acceptTeeEula",
                                      "",
                                      "Replace existing agent with the same agent name",
                                      ".{0}config.{1} --unattended --url https://myaccount.visualstudio.com --auth pat --token myToken --pool default --agent myAgent --replace --acceptTeeEula",
                                      "",
                                      "Specify the agent work directory (Windows)",
                                      ".\\config.cmd --unattended --url https://myaccount.visualstudio.com --auth pat --token myToken --pool default --agent myAgent --work D:\\agent_work",
                                      "",
                                      "Specify the agent work directory (macOS and Linux)",
                                      "./config.sh --unattended  --url https://myaccount.visualstudio.com --auth pat --token myToken --pool default --agent myAgent --work usr/local/agent_work",
                                      "",
                                      "Run as a Windows service that logs on as NetworkService (Windows only)",
                                      ".\\config.cmd --unattended --url https://myaccount.visualstudio.com --auth pat --token myToken --pool default --agent myAgent --runAsService",
                                      "",
                                      "Run as a Windows service that logs on as a domain account (Windows only)",
                                      ".\\config.cmd --unattended --url https://myaccount.visualstudio.com --auth pat --token myToken --pool default --agent myAgent --runAsService --windowsLogonAccount myDomain\\myUserName --windowsLogonPassword myPassword",
                                      "",
                                      "Run as an auto logon agent (Windows only)",
                                      ".\\config.cmd --unattended --url https://myaccount.visualstudio.com --auth pat --token myToken --pool default --agent myAgent --runAsAutoLogon --windowsLogonAccount myDomain\\myUserName --windowsLogonPassword myPassword",
                                      "",
                                      "Run as an auto logon agent and do not restart after configuration (Windows only)",
                                      ".\\config.cmd --unattended --url https://myaccount.visualstudio.com --auth pat --token myToken --pool default --agent myAgent --runAsAutoLogon --windowsLogonAccount myDomain\\myUserName --windowsLogonPassword myPassword --noRestart",
                                      "",
                                      "Deployment group agent run as Windows service that logs on as Local System (Windows only)",
                                      ".\\config.cmd --unattended --deploymentGroup --url https://myaccount.visualstudio.com --auth pat --token myToken --projectName myProject --deploymentGroupName myDeploymentGroup --agent myAgent --addDeploymentGroupTags --deploymentGroupTags \"web, db\" --runAsService --windowsLogonAccount \"NT AUTHORITY\\SYSTEM\"",
                                      "",
                                      "Deployment group agent with tags",
                                      ".{0}config.{1} --unattended --deploymentGroup --url https://myaccount.visualstudio.com --auth pat --token myToken --projectName myProject --deploymentGroupName myDeploymentGroup --agent myAgent --addDeploymentGroupTags --deploymentGroupTags \"web, db\" --runAsService --windowsLogonAccount \"NT AUTHORITY\\SYSTEM\" --acceptTeeEula"
                                  ],
    "CommandLineHelp_Env":  [
                                "Variables de entorno:",
                                "Cualquier argumento de la línea de comandos se puede especificar como una variable de entorno. Utilice el formato",
                                "VSTS_AGENT_INPUT_\u003cARGUMENT_NAME\u003e. Por ejemplo: VSTS_AGENT_INPUT_PASSWORD"
                            ],
    "CommandLineHelp_LocalRun":  [
                                     ".{0}run.{1} localRun [opciones]",
                                     "",
                                     "Este comando está actualmente en versión preliminar. La interfaz y el comportamiento",
                                     "cambiarán en una versión futura.",
                                     "",
                                     "Ejecuta un trabajo en modo local. Especifique --url para actualizar la memoria caché de tareas",
                                     "local si hay disponibles versiones más recientes de las tareas a las que se hace referencia.",
                                     "",
                                     "Opciones de ejecución:",
                                     " --yml \u003cyml\u003e                       Ruta de acceso al archivo .yml de definición de proceso. De forma",
                                     "                                   predeterminada, busca en el directorio actual",
                                     ".",
                                     " --phase \u003cphase\u003e                   Fase que debe ejecutarse. Esta opción es necesaria cuando se",
                                     "                                   detecta más de una fase en el archivo .yml.",
                                     " --matrix \u003cmatrix\u003e                 Matriz que debe ejecutarse. Esta opción es necesaria cuando la",
                                     "                                   fase contiene más de una matriz de configuración de trabajos.",
                                     "",
                                     "{2}",
                                     "",
                                     "{3}"
                                 ],
    "CommandLineHelp_Remove":  [
                                   ".{0}config.{1} remove [opciones]",
                                   "",
                                   "{2}",
                                   "",
                                   "{3}",
                                   "",
                                   "Ejemplos de eliminación desatendida:",
                                   "",
                                   "VSTS",
                                   ".{0}config.{1} remove --unattended --auth pat --token myToken",
                                   "",
                                   "TFS local con autenticación integrada (solo Windows)",
                                   ".{0}config.{1} remove --unattended --auth integrated",
                                   "",
                                   "TFS local con autenticación integrada",
                                   ".{0}config.{1} remove --unattended --auth negotiate --username myDomain\\myUserName --password myPassword"
                               ],
    "CommandNotFound":  "No se puede encontrar la extensión del comando para ##vso[{0}.command]. Consulte la documentación de referencia (http://go.microsoft.com/fwlink/?LinkId=817296)",
    "CommandNotSupported":  "Los comandos {0} no se admiten para el flujo {1}. Consulte la documentación de referencia (http://go.microsoft.com/fwlink/?LinkId=817296)",
    "CommandProcessFailed":  "No se puede procesar correctamente el comando \"{0}\". Consulte la documentación de referencia (http://go.microsoft.com/fwlink/?LinkId=817296).",
    "ConnectingToServer":  "Conectando al servidor...",
    "ConnectSectionHeader":  "Conectar",
    "ConnectToServer":  "Conectando al servidor.",
    "CouldNotRemoveService":  "No se puede eliminar el servicio \u0027{0}\u0027.",
    "CreateUserWithSameUIDInsideContainer":  "Try create an user with UID \u0027{0}\u0027 inside the container.",
    "CurrentUTC":  "Hora UTC actual: {0}",
    "CustomLogDoesNotExist":  "La ruta de acceso del archivo de registro no se ha proporcionado o el archivo no existe: \u0027{0}\u0027",
    "CustomMarkDownSummaryDoesNotExist":  "La ruta de acceso del archivo de resumen Markdown no se ha proporcionado o el archivo no existe : \u0027{0}\u0027",
    "DeleteGCTrackingFile":  "Eliminar el archivo de seguimiento de GC después de eliminar \"{0}\"",
    "DeleteUnusedBuildDir":  "Eliminar directorios de compilación sin usar",
    "Deleting":  "Eliminando: {0}",
    "DeletingCredentials":  "Quitando .credentials",
    "DeletingSettings":  "Quitando .agent",
    "DeploymentGroupName":  "Nombre del grupo de implementación",
    "DeploymentGroupNotFound":  "No se encontró el grupo de implementación: \"{0}\"",
    "DeploymentGroupTags":  "Comma separated list of tags (e.g web, db)",
    "DeploymentGroupTagsAddedMsg":  "Las etiquetas se agregaron correctamente",
    "DeploymentMachineWithSameNameAlreadyExistInDeploymentGroup":  "El grupo de implementación {0} ya contiene una máquina con el nombre {1}.",
    "DeploymentPoolName":  "Deployment Pool name",
    "DeploymentPoolNotFound":  "Deployment pool not found: \u0027{0}\u0027",
    "DirectoryHierarchyUnauthorized":  "Se requiere permiso para leer el contenido del directorio para \u0027{0}\u0027 y cada directorio por encima en la jerarquía. {1}",
    "DirectoryIsEmptyForArtifact":  "El directorio \u0027{0}\u0027 está vacío. No se agregará nada en el artefacto de compilación \u0027{1}\u0027.",
    "DirectoryNotFound":  "Directorio no encontrado: \u0027{0}\u0027",
    "DirExpireLimit":  "Límite de expiración del directorio: {0} días.",
    "DiscoverBuildDir":  "Detectar directorios de compilación obsoletos que no se hayan usado durante más de {0} días.",
    "DownloadAgent":  "Descargando el agente {0}",
    "DownloadArtifacts":  "Descargar artefactos",
    "DownloadArtifactsFailed":  "Error al descargar los artefactos: {0}",
    "DownloadingJenkinsCommitsBetween":  "Descargando confirmaciones entre los trabajos {0} a {1}",
    "DownloadingJenkinsCommitsFailedWithException":  "No se pudieron descargar confirmaciones del artefacto de Jenkins {0}. Excepción: {1}",
    "DownloadingTask0":  "Descargando tarea: {0}",
    "EnsureJobFinished":  "Esperando a que el trabajo actual termine de ejecutarse.",
    "EnsureTasksExist":  "Descargar todas las tareas necesarias.",
    "EnterValidValueFor0":  "Escriba un valor válido para {0}.",
    "ErrorDuringBuildGC":  "No se pueden detectar elementos no utilizados según \"{0}\". Inténtelo la próxima vez.",
    "ErrorDuringBuildGCDelete":  "No se puede finalizar GC según \"{0}\". Inténtelo la próxima vez.",
    "ErrorOccurred":  "Error: {0}",
    "ErrorOccurredWhilePublishingCCFiles":  "Error al publicar archivos de cobertura de código. Error: {0}",
    "EulasSectionHeader":  "Contratos de licencia para el usuario final",
    "EvaluateTrackingFile":  "Evaluar el archivo de seguimiento BuildDirectory: {0}",
    "Failed":  "Con error: ",
    "FailedDeletingTempDirectory0Message1":  "Error al eliminar el directorio temporal \u0027{0}\u0027. {1}",
    "FailedToAddTags":  "No se pudieron aplicar etiquetas al agente. Vuelva a intentarlo o presione Ctrl-C para salir. También puede ir a la página web del grupo de implementación para agregar etiquetas",
    "FailedToConnect":  "Error al conectar. Vuelva a intentarlo o presione Ctrl-C para salir.",
    "FailedToDeleteTempScript":  "Error al eliminar el archivo de script insertado temporal \u0027{0}\u0027. {1}",
    "FailedToFindDeploymentGroup":  "No se pudo encontrar el grupo de implementación. Vuelva a intentarlo o presione Ctrl-C para salir",
    "FailedToFindPool":  "Error al encontrar el nombre del grupo. Vuelva a intentarlo o presione Ctrl-C para salir.",
    "FailedToLockServiceDB":  "Error al bloquear la base de datos del servicio para escritura",
    "FailedToOpenSCM":  "Error al abrir el Administrador de control de servicios",
    "FailedToOpenSCManager":  "Error al abrir el Administrador de control de servicios.",
    "FailedToPublishTestResults":  "Error al publicar los resultados de pruebas: {0}",
    "FailedToReadFile":  "Error al leer {0}. Error : {1}.",
    "FailedToReplaceAgent":  "Error al reemplazar el agente.  Vuelva a intentarlo o presione Ctrl-C para salir.",
    "FailToRemoveGitConfig":  "No se puede quitar \"{0}\" de la configuración de Git. Para quitar la credencial, ejecute \"git config --unset-all {0}\" desde la raíz del repositorio \"{1}\".",
    "FileContainerUploadFailed":  "No se puede copiar el archivo al servidor StatusCode={0}: {1}. Ruta de acceso del archivo de origen: {2}. Ruta de acceso del servidor de destino: {3}",
    "FileDoesNotExist":  "El archivo \u0027{0}\u0027 no existe o no es accesible.",
    "FileNotFound":  "Archivo no encontrado: \u0027{0}\u0027",
    "FilePathNotFound":  "No se encuentra la ruta de acceso de archivo de \"{0}\".",
    "FileUploadCancelled":  "La carga de archivos se ha cancelado durante la carga del archivo: \u0027{0}\u0027.",
    "FileUploadDetailTrace":  "Seguimiento de carga detallado del archivo que no se puede cargar: {0}",
    "FileUploadFailed":  "Error al cargar \u0027{0}\u0027 debido a \u0027{1}\u0027.",
    "FileUploadFailedAfterRetry":  "Error al cargar el archivo incluso después de reintentarlo.",
    "FileUploadFailedRetryLater":  "No se pudieron cargar {0} archivos, inténtelo de nuevo tras un minuto.",
    "FileUploadFinish":  "El archivo: \u0027{0}\u0027 tarda {1} milisegundos en finalizar la carga",
    "FileUploadProgress":  "Total de archivos: {0} ---- Archivos procesados: {1} ({2}%)",
    "FileUploadProgressDetail":  "Cargando \u0027{0}\u0027 ({1}%)",
    "FileUploadRetry":  "Iniciar el reintento {0} de carga de los archivos con error.",
    "FileUploadRetryInSecond":  "Reintentar la carga de archivos después de {0} segundos.",
    "FileUploadRetrySucceed":  "La carga de archivos se completó correctamente tras el reintento.",
    "FileUploadSucceed":  "La carga de archivos se completó correctamente.",
    "FinishMaintenance":  "Finalizó el mantenimiento: {0}",
    "GCBuildDir":  "Eliminar el directorio de compilación huérfano y obsoleto.",
    "GCBuildDirNotEnabled":  "La opción para eliminar el directorio de compilación huérfano y obsoleto no está habilitada.",
    "GCDirIsEmpty":  "Ningún directorio de compilación necesita ser GC. \"{0}\" no tiene ningún archivo de seguimiento.",
    "GCDirNotExist":  "Ningún directorio de compilación necesita ser GC. \"{0}\" no existe.",
    "GCOldFormatTrackingFile":  "Marcar el archivo de seguimiento \"{0}\" para GC porque nunca se ha usado.",
    "GCUnusedTrackingFile":  "Marcar el archivo de seguimiento \"{0}\" para GC porque no se ha usado durante {1} días.",
    "GenerateAndRunUpdateScript":  "Genera y ejecuta el script de actualización.",
    "GetSources":  "Obtener orígenes",
    "GrantContainerUserSUDOPrivilege":  "Grant user \u0027{0}\u0027 SUDO privilege and allow it run any command without authentication.",
    "GrantingFilePermissions":  "Concesión de permisos de archivo a \"{0}\".",
    "GroupDoesNotExists":  "El grupo: {0} no existe",
    "InitializeContainer":  "Inicializar contenedor",
    "InitializeJob":  "Inicializar trabajo",
    "InvalidAutoLogonCredential":  "Se han proporcionado credenciales de Windows no válidas para el inicio de sesión automático. Asegúrese de que las credenciales proporcionadas sean válidas y tengan derechos de inicio de sesión interactivo en la máquina. Vuelva a intentarlo o pulse Ctrl-C para salir",
    "InvalidCommandArg":  "El argumento del comando \u0027{0}\u0027 contiene uno o varios de los caracteres no válidos siguientes: \", \\r, \\n",
    "InvalidCommandResult":  "El comando no tiene un valor de resultado válido.",
    "InvalidCompletedDate":  "La duración de cada serie de pruebas se usará para calcular el tiempo, ya que la fecha de finalización máxima {0} obtenida del archivo de resultados de pruebas es mayor que la fecha de inicio mínima {1}.",
    "InvalidConfigFor0TerminatingUnattended":  "Se proporcionó una configuración no válida a {0}. Finalizando la configuración no atendida.",
    "InvalidDateFormat":  "La duración de cada serie de pruebas se usará para calcular el tiempo, ya que se obtuvo un formato de fecha no válido del archivo de resultados: {0} (Fecha de inicio {1}. Fecha de finalización: {2})",
    "InvalidEndpointField":  "Invalid endpoint field. Valid values are url, dataParameter and authParameter",
    "InvalidEndpointId":  "Invalid endpoint id.",
    "InvalidEndpointUrl":  "Invalid endpoint Url.",
    "InvalidFileFormat":  "Formato de archivo no válido.",
    "InvalidGroupName":  "Nombre de grupo no válido - {0}",
    "InvalidMember":  "No se puedo agregar un nuevo miembro a un grupo local porque el miembro tiene un tipo de cuenta erróneo. Si está realizando la configuración en un controlador de dominio, las cuentas de la máquina integradas no se podrán agregar a los grupos locales. Debe usar en cambio una cuenta de usuario de dominio.",
    "InvalidResultFiles":  "Archivo de resultados no válido. Asegúrese de que el formato de resultados del archivo \u0027{0}\u0027 coincide con el formato de resultados de pruebas \u0027{1}\u0027.",
    "InvalidSIDForUser":  "Identificador de seguridad no válido para el usuario {0}\\{1} durante la configuración o desconfiguración del inicio de sesión automático. Consulte los registros para obtener más información.",
    "InvalidValueInXml":  "No se puede recuperar el valor para \"{0}\" del archivo de resumen \"{1}\". Compruebe que el archivo de resumen tiene un formato correcto y vuelva a intentarlo.",
    "InvalidWindowsCredential":  "Se especificaron credenciales de Windows no válidas. Vuelva a intentarlo o presione Ctrl-C para salir.",
    "JenkinsBuildDoesNotExistsForCommits":  "No se encuentra el índice de las compilaciones de Jenkins {0} y {1}. Los índices encontrados son {2} y {3}. Probablemente, la compilación no existe.",
    "JenkinsCommitsInvalidEndJobId":  "El endJobId {0} asociado con el artefacto de Jenkins {1} no es válido. No se descargarán confirmaciones.",
    "JenkinsDownloadingChangeFromCurrentBuild":  "No se encuentra el endJobId. Se recuperará el conjunto de cambios de la compilación actual.",
    "JenkinsNoCommitsToFetch":  "Se está implementando la misma compilación. No hay cambios para recuperar.",
    "JenkinsRollbackDeployment":  "Descargando confirmaciones para la implementación de reversión entre los trabajos {0} y {1}",
    "JobCompleted":  "{0:u}: Trabajo {1} completado con resultado: {2}",
    "ListenForJobs":  "{0:u}: Esperando los trabajos",
    "LocalClockSkewed":  "Es posible que el reloj del equipo local no esté sincronizado con la hora del servidor con una diferencia de más cinco minutos. Sincronice el reloj con la hora del dominio o de Internet e inténtelo de nuevo.",
    "LocalSystemAccountNotFound":  "No se puede encontrar la cuenta del sistema local",
    "Maintenance":  "Mantenimiento",
    "MemberDoesNotExists":  "El miembro: {0} no existe.",
    "MinimumNetFramework":  "Se requiere .NET Framework x64 4.5 o superior.",
    "MinimumNetFramework46":  "Se requiere .NET Framework x64 4.6 o superior.",
    "MinimumNetFrameworkTfvc":  [
                                    "No está instalado .NET Framework x64 4.6 o superior.",
                                    "",
                                    ".Se requiere NET Framework x64 4.6 o superior para sincronizar repositorios TFVC. No es necesario para sincronizar repositorios GIT."
                                ],
    "MinRequiredDockerClientVersion":  "La versión mínima requerida de cliente de Docker es \"{0}\", su versión de cliente de Docker (\"{1}\") es \"{2}\"",
    "MinRequiredDockerServerVersion":  "La versión mínima requerida de servidor de Docker es \"{0}\", su versión de servidor de Docker (\"{1}\") es \"{2}\"",
    "MinRequiredGitLfsVersion":  "La versión mínima de git-lfs necesaria es \"{0}\". Su versión de git-lfs (\"{1}\") es \"{2}\".",
    "MinRequiredGitVersion":  "La versión mínima requerida de Git es \u0027{0}\u0027, su versión de Git (\u0027{1}\u0027) es \u0027{2}\u0027",
    "MissingAgent":  "El agente ya no existe en el servidor. Vuelva a configurar el agente.",
    "MissingAttachmentFile":  "No se puede cargar el archivo de datos adjuntos de la tarea, la ubicación del archivo de datos adjuntos no se ha especificado o el archivo de datos adjuntos no existe en el disco.",
    "MissingAttachmentName":  "No se pueden agregar datos adjuntos de tarea, no se ha indicado el nombre del dato adjunto.",
    "MissingAttachmentType":  "No se pueden agregar datos adjuntos de tarea, no se ha indicado el tipo del dato adjunto.",
    "MissingConfig":  "No se puede conectar al servidor, porque faltan los archivos de configuración. Omitiendo la eliminación del agente desde el servidor.",
    "MissingEndpointField":  "Required field \u0027field\u0027 is missing in ##vso[task.setendpoint] command.",
    "MissingEndpointId":  "Required field \u0027id\u0027 is missing in ##vso[task.setendpoint] command.",
    "MissingEndpointKey":  "Required field \u0027key\u0027 is missing in ##vso[task.setendpoint] command.",
    "MissingTaskVariableName":  "Falta el campo obligatorio \"variable\" en el comando ##vso[task.settaskvariable].",
    "MissingTimelineRecordId":  "No se puede actualizar el registro de escala de tiempo, porque no se ha proporcionado el id. de registro.",
    "MissingVariableName":  "Falta el campo obligatorio \"variable\" en el comando ##vso[task.setvariable].",
    "ModifyingCoberturaIndexFile":  "Modificando el archivo Cobertura Index",
    "N":  "N",
    "NameRequiredForTimelineRecord":  "Se requiere un nombre para este nuevo registro de escala de tiempo.",
    "NeedAdminForAutologonCapability":  "Necesita privilegios de administrador para configurar el agente con inicio de sesión automático.",
    "NeedAdminForAutologonRemoval":  "Necesita privilegios de administrador para desconfigurar un agente que se ejecuta con inicio de sesión automático.",
    "NeedAdminForConfigAgentWinService":  "Se requieren privilegios de administrador para configurar el agente como servicio de Windows.",
    "NeedAdminForUnconfigWinServiceAgent":  "Se necesitan privilegios de administrador para anular la configuración del agente que se ejecuta como servicio de Windows.",
    "NetworkServiceNotFound":  "No se puede encontrar la cuenta de servicio de red.",
    "NoArtifactsFound":  "No hay artefactos disponibles en la versión \"{0}\".",
    "NoRestart":  "Restart the machine at a later time? (Y/N) (press enter for N)",
    "NoRestartSuggestion":  "AutoLogon was enabled during agent configuration. It is recommended that the machine be restarted for AutoLogon settings to take effect.",
    "NotLinux":  "Esta versión del agente está compilada para Linux. Instale una compilación correcta para el sistema opertivo.",
    "NotOSX":  "Esta versión del agente está compilada para OSX. Instale una compilación correcta para el sistema opertivo.",
    "NotWindows":  "Esta versión del agente está compilada para Windows. Instale una compilación correcta para el sistema opertivo.",
    "OperatingSystemShutdown":  "Se va a cerrar el sistema operativo del equipo \"{0}\"",
    "OperationFailed":  "Error: Error de operación {0} con código de retorno {1}",
    "OutputVariablePublishFailed":  "No se pudieron publicar variables de salida.",
    "OverwriteAutoLogon":  "El inicio de sesión automático ya está habilitado para el usuario \"{0}\". ¿Quiere sobrescribir la configuración actual de esta característica? (S/N)",
    "ParentTimelineNotCreated":  "No se creó el registro de escala de tiempo principal para este nuevo registro de escala de tiempo.",
    "Password":  "contraseña",
    "PathNotExist":  "La ruta de acceso no existe: {0}",
    "PersonalAccessToken":  "token de acceso personal",
    "PlatformNotSupport":  "No se admite la ejecución del agente en esta plataforma. La plataforma actual es {0} y se ha compilado para {1}.",
    "PoolNotFound":  "Grupo de agentes no encontrado: \u0027{0}\u0027",
    "PostJob":  "Posterior al trabajo: {0}",
    "PowerOptionsConfigError":  "Error al configurar las opciones de energía. Consulte los registros para obtener más información.",
    "PowerShellNotInstalledMinVersion0":  "PowerShell no está instalado. Versión mínima obligatoria: {0}",
    "PreJob":  "Previo al trabajo: {0}",
    "PrepareBuildDir":  "Preparar el directorio de compilación.",
    "PrepareReleasesDir":  "Preparar el directorio de versión.",
    "PrepareTaskExecutionHandler":  "Preparando el controlador de la ejecución de tareas.",
    "Prepending0WithDirectoryContaining1":  "Anteponiendo la variable de entorno {0} con el directorio que contiene \u0027{1}\u0027.",
    "PrerequisitesSectionHeader":  "Requisitos previos",
    "ProcessCompletedWithCode0Errors1":  "El proceso se completó con código de salida {0} y se escribieron {1} errores en el flujo de error.",
    "ProcessCompletedWithExitCode0":  "El proceso se completó con código de salida {0}.",
    "ProcessExitCode":  "Código de salida {0} devuelto en el proceso: nombre de archivo \u0027{1}\u0027, argumentos \u0027{2}\u0027.",
    "ProfileLoadFailure":  "No se puede cargar el perfil de usuario de {0}\\{1}. No es posible la configuración de inicio de sesión automático.",
    "ProjectName":  "Nombre de proyecto",
    "Prompt0":  "Escriba {0}.",
    "Prompt0Default1":  "Escriba {0} (presione Entrar para {1}).",
    "PSScriptError":  "El script de PowerShell se completó con {0} errores.",
    "PublishCodeCoverage":  "Publicar cobertura de código",
    "PublishedCodeCoverageArtifact":  "Publicado \u0027{0}\u0027 como artefacto \u0027{1}\u0027",
    "PublishingCodeCoverage":  "Publicando datos de resumen de cobertura en el servidor TFS.",
    "PublishingCodeCoverageFiles":  "Publicando archivos de cobertura de código en el servidor TFS.",
    "PublishingTestResults":  "Publicando resultados de prueba para la ejecución de prueba \u0027{0}\u0027.",
    "PublishTestResults":  "Publicar resultados de la prueba",
    "QueryingWorkspaceInfo":  "Consultando información del área de trabajo.",
    "QueueConError":  "{0:u}: Agent connect error: {1}. Retrying until reconnected.",
    "QueueConnected":  "{0:u}: Agente reconectado.",
    "ReadingCodeCoverageSummary":  "Leyendo el resumen de cobertura de código de \u0027{0}\u0027",
    "RegisterAgentSectionHeader":  "Registrar agente",
    "RenameIndexFileCoberturaFailed":  "Error al cambiar el nombre de \u0027{0}\u0027 a \u0027{1}\u0027 al publicar archivos de cobertura de código para \u0027{2}\u0027. Excepción interna: \u0027{3}\u0027",
    "Replace":  "¿Reemplazar? (S/N)",
    "RestartIn15SecMessage":  "La máquina se va a reiniciar en 15 segundos...",
    "RestartMessage":  "Reinicie la máquina para iniciar el agente y para que surta efecto la configuración de inicio de sesión automático.",
    "ResultsCommandNotFound":  "##vso[results.{0}] no es un comando reconocido para la extensión del comando Task. TODO: DOC aka link",
    "RMApiFailure":  "No se pudo ejecutar la API {0}. Código de error: {1}",
    "RMArtifactContainerDetailsInvalidError":  "El artefacto no tiene detalles de contenedor válidos: {0}",
    "RMArtifactContainerDetailsNotFoundError":  "El artefacto no contiene detalles de contenedor: {0}",
    "RMArtifactDetailsIncomplete":  "No se puede encontrar la información obligatoria para descargar el artefacto.",
    "RMArtifactDirectoryNotFoundError":  "El directorio del artefacto no existe: {0}. Esto puede ocurrir si la contraseña de la cuenta {1} se ha modificado recientemente y no se ha actualizado para el agente. Si este es el caso, considere la posibilidad de volver a configurar el agente.",
    "RMArtifactDownloadBegin":  "Descargando artefacto vinculado {0} de tipo {1}...",
    "RMArtifactDownloadFinished":  "Artefacto vinculado descargado {0}",
    "RMArtifactDownloadRequestCreationFailed":  "Error al crear la solicitud para descargar el artefacto desde la dirección URL: {0}",
    "RMArtifactEmpty":  "El artefacto no contiene archivos para descargar.",
    "RMArtifactMatchNotFound":  "El artefacto de compilación \u0027{0}\u0027 no coincide con ningún patrón de nomenclatura, omitiendo la descarga.",
    "RMArtifactNameDirectoryNotFound":  "El directorio \u0027{0}\u0027 no existe. Retrocediendo al directorio principal: {1}",
    "RMArtifactsDownloadFinished":  "Descarga de artefactos finalizada",
    "RMArtifactTypeFileShare":  "Tipo de artefacto: FileShare",
    "RMArtifactTypeNotSupported":  "La administración de versiones no admite la descarga del tipo de artefacto {0} en la versión actual.",
    "RMArtifactTypeServerDrop":  "Tipo de artefacto: ServerDrop",
    "RMArtifactVersionNotBelongToArtifactSource":  "La versión del artefacto con id. {0} no pertenece al origen del artefacto vinculado con id. {1}.",
    "RMBuildNotFromLinkedDefinition":  "La compilación {0} no pertenece a la definición de compilación vinculada {1}",
    "RMCachingAllItems":  "Almacenando en caché todos los elementos del contenedor de archivos...",
    "RMCachingComplete":  "Almacenamiento en caché completo. ({0} ms)",
    "RMCachingContainerItems":  "Almacenando en caché los elementos bajo \u0027{0}\u0027 del contenedor de archivos...",
    "RMContainerItemNotSupported":  "El tipo de elemento de contenedor \u0027{0}\u0027 no se admite.",
    "RMContainerItemPathDoesnotExist":  "La ruta de acceso del elemento del contenedor de archivos no empieza por {0}: {1}",
    "RMContainerItemRequestTimedOut":  "Se agotó el tiempo de espera de la solicitud tras {0} segundos; se va a entrar en modo de suspensión durante {1} segundos y se intentará de nuevo. Solicitud: {2} {3}",
    "RMCreatedArtifactsDirectory":  "Se ha creado el directorio de artefactos: {0}",
    "RMCreatingArtifactsDirectory":  "Creando el directorio de artefactos: {0}",
    "RMCustomEndpointNotFound":  "No se encuentra la información requerida en el trabajo para descargar el artefacto personalizado: {0}",
    "RMDownloadArtifactUnexpectedError":  "Error inesperado al descargar artefactos",
    "RMDownloadBufferSize":  "Tamaño de búfer de descarga: {0}",
    "RMDownloadComplete":  "Descarga completada.",
    "RMDownloadingArtifact":  "Descargando el artefacto",
    "RMDownloadingArtifactFromFileContainer":  "Descargando el artefacto del contenedor de archivos {0} en el destino {1}",
    "RMDownloadingArtifactFromFileShare":  "Descargando el artefacto del recurso compartido de archivos {0} en el destino {1}",
    "RMDownloadingArtifactUsingRobocopy":  "Descargando el artefacto con Robocopy.",
    "RMDownloadingCommits":  "Descargando confirmaciones",
    "RMDownloadingJenkinsArtifacts":  "Descargando artefactos del servidor Jenkins",
    "RMDownloadProgress":  "{0} archivos colocados: {1} descargados, {2} vacíos",
    "RMDownloadProgressDetails":  "{0} MB descargados a {1} KB/s. Tiempo de descarga: {2}.",
    "RMDownloadStartDownloadOfFile":  "Descargando el archivo {0}",
    "RMDownloadTaskCompletedStatus":  "No se han completado tareas de descarga en {0} minutos. Estados de las tareas que quedan:",
    "RMDownloadTaskStates":  " {0}: \t{1} tareas.",
    "RMEnsureArtifactFolderExistsAndIsClean":  "Se asegurará de que la carpeta de artefactos {0} existe y está limpia.",
    "RMEnvironmentVariablesAvailable":  "A continuación se muestran las variables de entorno. Tenga en cuenta que se puede hacer referencia a estas variables de entorno en la tarea (in the ReleaseDefinition) reemplazando \"_\" por \".\". Por ejemplo, se puede hacer referencia a la variable de entorno AGENT_NAME mediante Agent.Name en ReleaseDefinition: {0}.",
    "RMErrorDownloadingContainerItem":  "Error al descargar {0}: {1}",
    "RMErrorDuringArtifactDownload":  "Error al descargar: {0}",
    "RMFailedCreatingArtifactDirectory":  "No se pudo crear el directorio de artefactos de versión \"{0}\".",
    "RMFileShareArtifactErrorOnNonWindowsAgent":  "No se pueden descargar artefactos de un recurso compartido de archivos mediante un agente OSX o Linux. Puede descargar artefactos del servidor o usar un agente de Windows.",
    "RMGitEndpointNotFound":  "No se encuentra la información requerida en el trabajo para descargar el artefacto Git de Team Foundation.",
    "RMGitHubEndpointNotFound":  "No se puede encontrar la información obligatoria en el trabajo para descargar el artefacto GitHub: {0}.",
    "RMGotJenkinsArtifactDetails":  "Recibidos detalles del artefacto Jenkins",
    "RMJenkinsBuildId":  "BuildId: {0}",
    "RMJenkinsEndpointNotFound":  "No se puede encontrar la información obligatoria en el trabajo para descargar el artefacto Jenkins: {0}.",
    "RMJenkinsInvalidBuild":  "La compilación {0} de Jenkins no es válida.",
    "RMJenkinsJobName":  "Nombre de trabajo: {0}",
    "RMJenkinsNoArtifactsFound":  "No hay ningún artefacto disponible en la compilación {0} de Jenkins.",
    "RMLowAvailableDiskSpace":  "Low disk space on {0} drive, less than 100 MB is available.",
    "RMNoBuildArtifactsFound":  "No hay artefactos disponibles en la compilación {0}.",
    "RMParallelDownloadLimit":  "Límite de descarga en paralelo: {0}",
    "RMPrepareToGetFromJenkinsServer":  "Preparándose para obtener la información de artefactos desde el servidor Jenkins",
    "RMPreparingToDownload":  "Preparándose para la descarga del artefacto: {0}",
    "RMPreparingToGetBuildArtifactList":  "Preparándose para obtener la lista de artefactos disponibles desde la compilación",
    "RMReAttemptingDownloadOfContainerItem":  "Reintentando la descarga de {0}. Error: {1}",
    "RMReceivedGithubArtifactDetails":  "Detalles del artefacto de GitHub recibidos",
    "RMRemainingDownloads":  "{0} descargas restantes.",
    "RMRetryingArtifactDownload":  "Reintentando descarga...",
    "RMRetryingCreatingArtifactsDirectory":  "No se pudo crear el directorio de artefactos de la versión {0}, excepción: {1}. Se reintentará la creación del directorio.",
    "RMRobocopyBasedArtifactDownloadExitCode":  "Código de salida de Robocopy: {0}",
    "RMRobocopyBasedArtifactDownloadFailed":  "No se pudo realizar la descarga con Robocopy. Código de salida: {0}",
    "RMStartArtifactsDownload":  "Iniciando la descarga de artefactos...",
    "RMStreamTypeNotSupported":  "La administración de versiones no admite la descarga del tipo de secuencia {0} en la versión actual",
    "RMTfsVCEndpointNotFound":  "No se encuentra la información requerida en el trabajo para descargar el artefacto de Control de versiones de Team Foundation.",
    "RMUserChoseToSkipArtifactDownload":  "Omitiendo la descarga de artefactos basándose en la configuración especificada.",
    "RSAKeyFileNotFound":  "No se encontró el archivo de clave RSA {0}.",
    "RunAgentAsServiceDescription":  "¿Ejecutar agente como servicio? (S/N)",
    "RunAsAutoLogonDescription":  "¿Quiere configurar el inicio de sesión automático y ejecutar el agente durante el inicio? (S/N)",
    "RunningJob":  "{0:u}: Ejecutando el trabajo: {1}",
    "SavedSettings":  "{0:u}: Configuración guardada.",
    "ScanToolCapabilities":  "Examinando las funcionalidades de la herramienta.",
    "ScreenSaverPoliciesInspection":  "Comprobando si hay directivas que puedan impedir que se deshabilite el protector de pantalla.",
    "ScreenSaverPolicyWarning":  "Screensaver policy is defined on the machine. This may lead to screensaver being enabled again. Active screensaver may impact UI operations, for e.g., automated UI tests may fail.",
    "SelfManageGitCreds":  "Se encuentra en modo de autoadministrar las credenciales de Git. Asegúrese de que el equipo host del agente puede omitir cualquier desafío de autenticación de Git.",
    "ServerTarpit":  "El trabajo está actualmente limitado por el servidor. Puede experimentar retrasos en la salida de la línea de consola, la creación de informes sobre el estado del trabajo y las cargas del registro de tareas.",
    "ServerUrl":  "Dirección URL del servidor",
    "ServiceAlreadyExists":  "El servicio ya existe: {0}, se sustituirá",
    "ServiceConfigured":  "El servicio {0} se configuró correctamente.",
    "ServiceInstalled":  "El servicio {0} se instaló correctamente",
    "ServiceRecoveryOptionSet":  "El servicio {0} estableció correctamente la opción de recuperación",
    "ServiceStartedSuccessfully":  "El servicio {0} se inició correctamente.",
    "SessionCreateFailed":  "No se pudo crear la sesión. {0}",
    "SessionExist":  "Ya existe una sesión para este agente.",
    "SessionExistStopRetry":  "Detenga el reintento de SessionConflictException después de reintentarlo durante {0} segundos.",
    "SetBuildVars":  "Establecer variables de compilación.",
    "SetEnvVar":  "Estableciendo la variable de entorno {0}",
    "ShallowCheckoutFail":  "No se pudo ejecutar la restauración de GIT en el repositorio superficial. Puede deberse a que la recuperación de cambios de GIT con la profundidad \"{0}\" no incluye la confirmación de restauración \"{1}\". Consulte la documentación de referencia (http://go.microsoft.com/fwlink/?LinkId=829603).",
    "ShutdownMessage":  "Reiniciando la máquina para iniciar el agente en modo interactivo.",
    "Skipping":  "No existe. Omitiendo.",
    "SkipTrackingFileWithoutRepoType":  "Skip tracking file \u0027{0}\u0027, repository type haven\u0027t been updated yet.",
    "SourceArtifactProviderNotFound":  "No se encuentra el proveedor de origen para el artefacto de tipo {0}",
    "StartingArtifactDownload":  "Iniciando la descarga {0}",
    "StartMaintenance":  "Iniciar mantenimiento: {0}",
    "StepFinishing":  "Finalizando: {0}",
    "StepStarting":  "Iniciando: {0}",
    "StepTimedOut":  "La tarea agotó el tiempo de espera.",
    "StopContainer":  "Detener contenedor",
    "Success":  "Correcto: ",
    "SupportedRepositoryEndpointNotFound":  "No se puede hacer coincidir ningún punto de extremo de repositorio de origen con ninguno de los proveedores de origen admitidos.",
    "SupportedTaskHandlerNotFound":  "No se encontró controlador de ejecución de tareas admitido. Este error habitualmente significa que la tarea no incluye una implementación compatible con el sistema operativo actual. Póngase en contacto con el autor de la tarea para más detalles.",
    "SvnBranchCheckedOut":  "Se extrajo la rama {0} del repositorio {1} en la revisión {2}.",
    "SvnEmptyServerPath":  "La ruta de acceso relativa del servidor está asignada a \u0027{0}\u0027.",
    "SvnFileAlreadyExists":  "El archivo {0} ya existe.",
    "SvnIncorrectRelativePath":  "Ruta de acceso relativa incorrecta \u0027{0}\u0027 especificada.",
    "SvnMappingDuplicateLocal":  "Ignorando la asignación duplicada para la ruta de acceso local={0}",
    "SvnMappingDuplicateServer":  "Ignorando la asignación duplicada para la ruta de acceso del servidor={0}",
    "SvnMappingIgnored":  "Se ignoró el conjunto de asignación completo. Continuando con la asignación total de ramas.",
    "SvnNotInstalled":  "No se puede encontrar la utilidad de línea de comandos svn.",
    "SvnSyncingRepo":  "Sincronizando repositorio: {0} (Svn)",
    "TaskCommandNotFound":  "##vso[task.{0}] no es un comando reconocido para la extensión de comando Task. Consulte la documentación de referencia (http://go.microsoft.com/fwlink/?LinkId=817296).",
    "TeeEula":  [
                    "La compilación de orígenes desde un repositorio TFVC requiere la aceptación del Contrato de licencia de usuario final de Team Explorer Everywhere. Este paso no se necesita para compilar orígenes desde repositorios Git.",
                    "",
                    "Se puede encontrar una copia del Contrato de licencia de Team Explorer Everywhere en:",
                    "  {0}"
                ],
    "Telemetry":  "Telemetría",
    "TelemetryCommandDataError":  "No se pueden analizar los datos de telemetría {0}. Error: {1}",
    "TelemetryCommandFailed":  "Failed to publish telemetry data. Error {0}",
    "TelemetryCommandNotFound":  "##vso[telemetry.{0}] no es un comando reconocido para la extensión de comando Task.",
    "TestAgentConnection":  "Probando conexión del agente.",
    "TestAttachmentNotExists":  "Se omitirán los datos adjuntos porque no están disponibles en el disco: {0}",
    "TestResultsRemaining":  "Resultados de prueba restantes: {0}. Id. de ejecución de prueba: {1}",
    "Tfs2015NotSupported":  "El agente no es compatible con Windows en TFS 2015. El agente de Windows para TFS 2015  se puede descargar en la página de administración de grupos de agentes.",
    "TotalThrottlingDelay":  "El trabajo ha experimentado un total de {0} segundos de retraso provocados por la limitación del servidor.",
    "TotalUploadFiles":  "Cargando {0} archivos",
    "TypeRequiredForTimelineRecord":  "El tipo es obligatorio para este nuevo registro de escala de tiempo.",
    "UnableResolveArtifactType":  "No se puede inferir el tipo del artefacto a partir de la ubicación de artefacto: {0}.",
    "UnableToArchiveResults":  "No se pueden archivar los resultados de la prueba: {0}",
    "UnableToParseBuildTrackingConfig0":  "No se puede analizar la configuración de seguimiento de compilación heredada. Se creará en su lugar un nuevo directorio de compilación. El directorio anterior puede quedar en un estado no reclamado. Contenido de la configuración heredada: {0}",
    "UnconfigAutologon":  "Quitando la configuración de inicio de sesión automático",
    "UnconfigureOSXService":  "Desconfigure primero el servicio como se indica en https://www.visualstudio.com/en-us/docs/build/admin/agents/v2-osx",
    "UnconfigureServiceDService":  "Desconfigure primero el servicio como se indica en https://www.visualstudio.com/en-us/docs/build/admin/agents/v2-linux",
    "UninstallingService":  "Quitando servicio",
    "UnknownCodeCoverageTool":  "No se admite la herramienta de cobertura de código \u0027{0}\u0027.",
    "UnrecognizedCmdArgs":  "Argumentos de entrada de la línea de comandos no reconocidos: \u0027{0}\u0027. Para ver el uso, consulte: .\\config.cmd --help o ./config.sh --help",
    "UnregisteringAgent":  "Quitando agente del servidor",
    "UpdateBuildNumber":  "Actualizar número de compilación",
    "UpdateBuildNumberForBuild":  "Actualizar número de compilación {0} para la compilación {1}",
    "UpdateInProgress":  "Actualización del agente en curso, no lo apague.",
    "UpgradeToLatestGit":  "Para disfrutar de una mejor experiencia con GIT, debe actualizarlo al menos a la versión \"{0}\". Su versión de GIT actual es \"{1}\".",
    "UploadArtifact":  "Cargar artefacto",
    "UploadArtifactCommandNotSupported":  "No se admite la carga de un artefacto del servidor en {0}.",
    "UploadToFileContainer":  "Cargar \u0027{0}\u0027 en el contenedor de archivos: \u0027{1}\u0027",
    "UserName":  "nombre de usuario",
    "UserShutdownAgent":  "El agente ha recibido una señal de apagado. Esto puede ocurrir si el servicio de agente se ha detenido o si se ha cancelado un agente que se inició manualmente.",
    "Variable0ContainsCyclicalReference":  "No se puede expandir la variable \u0027{0}\u0027. Se detectó una referencia cíclica.",
    "Variable0ExceedsMaxDepth1":  "No se puede expandir la variable \u0027{0}\u0027. Se excedió la profundidad máxima de expansión ({1}).",
    "VSTSHostNonZeroReturn":  "LegacyVSTSPowerShellHost.exe se completó con código de retorno: {0}.",
    "WaitForServiceToStop":  "Esperando que se detenga el servicio...",
    "WindowsLogonAccountNameDescription":  "Cuenta de usuario que se utilizará para el servicio",
    "WindowsLogonPasswordDescription":  "Contraseña para la cuenta {0}",
    "WorkFolderDescription":  "carpeta de trabajo",
    "Y":  "S"
}
